const menuItems = [
    {
        "id":  "toki-8816-8816-kaliforniya-ebi",
        "name":  "Калифорния Эби",
        "description":  "Изысканное сочетание нежных креветок, свежего, хрустящего огурчика и сочного микс-краба, обернутых в воздушный рис и покрытых икрой масаго. Легкий, яркий и невероятно вкусный!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки",
                            "Майонез",
                            "Огурцы",
                            "Икра масаго"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6559e0a01564e_w900.jpg"
    },
    {
        "id":  "toki-8817-8817-kaliforniya-s-lososem",
        "name":  "Калифорния с лососем",
        "description":  "Гармоничное сочетание нежного филе лосося, сочного микс-краба и свежего огурчика, завернутых в мягкий рис и украшенных икрой масаго. Классика, которая покоряет с первого кусочка!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Лосось",
                            "Майонез",
                            "Огурцы",
                            "Икра масаго"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6559e1563448e_w900.jpg"
    },
    {
        "id":  "toki-8818-8818-kaliforniya-spicy",
        "name":  "Калифорния SPICY",
        "description":  "Яркий вкус с пикантной ноткой! Нежный сливочный сыр, сочная креветка и свежий огурчик в сочетании с острым соусом, завернутые в рис и украшенные икрой масаго. Для тех, кто любит поострее!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки темпура",
                            "Творожный сыр",
                            "Огурцы",
                            "Икра масаго",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/687774f467cb7_w900.jpg"
    },
    {
        "id":  "toki-8825-8825-filadelfiya-modern",
        "name":  "Филадельфия модерн",
        "description":  "Оригинальная филадельфия с творожным сыром, хрустящими огурчиками и пикантной шапочкой из охлажденного лосося и соуса \"Спайси\".",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6559ef441e549_w900.jpg"
    },
    {
        "id":  "toki-8826-8826-filadelfiya-ebi",
        "name":  "Филадельфия Эби",
        "description":  "Изысканный ролл с нежными креветками, сливочным сыром, свежим огурчиком и воздушным рисом. Сочетание свежести морепродуктов и мягкости сыра создаёт гармоничный вкус, который порадует каждого гурмана.",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Креветки"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6559f031996e5_w900.jpg"
    },
    {
        "id":  "toki-8827-8827-kanada-lait",
        "name":  "Канада лайт",
        "description":  "Легкая и изысканная вариация классического ролла. В составе: нежный сливочный сыр, свежий огурчик и аппетитный охлажденный лосось. Сверху – тонкие ломтики копченого угря и легкий соус унаги. Идеальный выбор для тех, кто ценит вкус и легкость!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/687e09ee8c170_w900.jpg"
    },
    {
        "id":  "toki-8829-8829-kanada-ebi",
        "name":  "Канада Эби",
        "description":  "Изысканное сочетание вкусов! Внутри – нежный сливочный сыр, хрустящий огурчик и сочные креветки. Снаружи – копченый угорь, покрытый ароматным соусом унаги и посыпанный кунжутом. Идеальный выбор для любителей морепродуктов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Креветки",
                            "Огурцы",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6559f49cc6457_w900.jpg"
    },
    {
        "id":  "toki-8831-8831-oblako",
        "name":  "Облако",
        "description":  "Нежное сочетание сливочного сыра и освежающего хрустящего огурчика, завернутых в воздушный слой риса и покрытых ароматным кунжутом. Легкий, воздушный и тающий во рту вкус, который подарит настоящее наслаждение!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6754c4d5abe46_w900.jpg"
    },
    {
        "id":  "toki-8832-8832-raduga",
        "name":  "Радуга",
        "description":  "Яркий и изысканный выбор для гурманов! Внутри нежный сливочный сыр, сочные огурчики и микс-краб. Сверху – аппетитная радуга из свежего тунца, угря, лосося и креветки. Легкий, свежий и гармоничный вкус, который подарит настоящее наслаждение!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Микс-краб",
                            "Огурцы",
                            "Тунец",
                            "Лосось",
                            "Креветки",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/68777470c4c33_w900.jpg"
    },
    {
        "id":  "toki-8835-8835-4-syra",
        "name":  "4 сыра",
        "description":  "Изысканное сочетание сырных вкусов и нежной креветки! Внутри – сливочный сыр, тягучая моцарелла и сочная креветка. Сверху – аппетитная шапка из опалённого сыра чеддер, ароматный соус унаги и изысканная посыпка из пармезана. Идеальное наслаждение для гурманов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки",
                            "Сыр творожный",
                            "Сыр чеддер",
                            "Сыр пармезан",
                            "Сыр моцарелла",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/655a04fb8d1af_w900.jpg"
    },
    {
        "id":  "toki-8836-8836-losos-bonito",
        "name":  "Лосось бонито",
        "description":  "Аппетитный ролл с насыщенным вкусом! Внутри сочный жареный лосось в соусе терияки, свежие огурчики и помидоры, дополненные пикантным спайси соусом. Сверху ролл покрыт ароматной стружкой бонито, которая добавляет изысканный копчёный акцент. Настоящее удовольствие для гурманов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Лосось жареный",
                            "Томаты",
                            "Огурцы",
                            "Соус \"Спайси\"",
                            "Стружка тунца"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/655a05f2b235b_w900.jpg"
    },
    {
        "id":  "toki-8838-8838-rozovaya-pantera",
        "name":  "Розовая пантера",
        "description":  "Яркое сочетание нежности и экзотики! Внутри сливочный сыр, сочная креветка и свежий лосось, создающие гармоничный вкус. Сверху ролл обёрнут в нежный маминори и щедро полит пикантным соусом манго-маракуйя, добавляющим тропическую нотку и лёгкую сладость. Идеальный выбор для тех, кто ищет что-то необычное и запоминающееся!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Маменори",
                            "Рис",
                            "Лосось",
                            "Креветки",
                            "Творожный сыр",
                            "Соус \"Манго\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/655a07a5e58b3_w900.jpg"
    },
    {
        "id":  "toki-8839-8839-green",
        "name":  "Green",
        "description":  "Лёгкость и свежесть в каждом кусочке! Нежный сливочный сыр и хрустящий огурчик внутри, обёрнуты в изысканный маминори. Сверху ролл украшен аппетитной шапочкой из сочной креветки, пикантного соуса спайси и свежего зелёного лука. Идеальный выбор для любителей гармоничного вкуса с яркими акцентами!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Маменори",
                            "Рис",
                            "Творожный сыр",
                            "Огурцы",
                            "Креветки",
                            "Лук зелёный",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/655a0a5580be2_w900.jpg"
    },
    {
        "id":  "toki-8842-8842-krispi-losos",
        "name":  "Криспи лосось",
        "description":  "Хрустящий и насыщенный вкусами! Внутри нежный сливочный сыр, свежий лосось и хрустящие огучики, создающие идеальный баланс текстур. Сверху ролл покрыт фирменным соусом (смесь майонеза и икры масаго), ароматным соусом унаги и щедрым количеством хрустящего жареного лука фри. Идеальное сочетание для тех, кто любит яркие и насыщенные вкусы!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Лосось",
                            "Творожный сыр",
                            "Огурцы",
                            "Лук жареный",
                            "Соус \"Унаги\"",
                            "Соус \"Фирменный\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/687e09ccd9ba7_w900.jpg"
    },
    {
        "id":  "toki-8843-8843-krispi-chiken",
        "name":  "Криспи чикен",
        "description":  "Аппетитный и хрустящий выбор для любителей насыщенных вкусов! Внутри нежный сливочный сыр, ароматная копченая курочка и свежие огурчики. Сверху ролл покрыт фирменным соусом (смесь майонеза и икры масаго), соусом унаги и обильно посыпан хрустящим жареным луком фри. Идеальное сочетание текстур и вкусов в каждом кусочке!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Копченая курица",
                            "Творожный сыр",
                            "Огурцы",
                            "Лук жареный",
                            "Соус \"Унаги\"",
                            "Соус \"Фирменный\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/655a0fe460664_w900.jpg"
    },
    {
        "id":  "toki-8844-8844-krispi-ebi",
        "name":  "Криспи эби",
        "description":  "Изысканное сочетание вкусов и текстур! Внутри нежный сливочный сыр, сочные креветки и свежий огурчик. Сверху ролл украшен фирменным соусом (смесь майонеза и икры масаго), соусом унаги и обильно посыпан хрустящим жареным луком фри. Аппетитный выбор для любителей морепродуктов и ярких вкусов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки",
                            "Творожный сыр",
                            "Огурцы",
                            "Лук жареный",
                            "Соус \"Унаги\"",
                            "Соус \"Фирменный\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/678630ab85e51_w900.jpg"
    },
    {
        "id":  "toki-8846-8846-dabl-ebi-roll",
        "name":  "Дабл эби ролл",
        "description":  "Изысканный ролл для настоящих гурманов! Внутри нежный микс из микс-краба, сочной креветки и хрустящего дайкона. Сверху — аппетитная креветка, покрытая ароматным соусом унаги и кунжутным соусом. Гармония вкусов и текстур в каждом кусочке!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки",
                            "Творожный сыр",
                            "Огурцы",
                            "Микс-краб",
                            "Дайкон",
                            "Соус \"Унаги\"",
                            "Соус \"Кунжутный\""
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/655a133249bf4_w900.jpg"
    },
    {
        "id":  "toki-8885-8885-filadelfiya-mango",
        "name":  "Филадельфия манго-маракуйя",
        "description":  "Изысканное сочетание нежной креветки, хрустящего такуана и сливочного сыра, обернутых в слайсы свежего лосося. Завершающий штрих – яркий соус манго-маракуйя, который добавляет тропическую сладость и легкую остринку, создавая гармонию вкусов в каждом кусочке.",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Такуан",
                            "Креветка",
                            "Соус \"манго-маракуйя\"",
                            "Лосось"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/66c99de69b379_w900.jpg"
    },
    {
        "id":  "toki-8888-8888-diablo",
        "name":  "Диабло",
        "description":  "Яркий вкус с огненным характером! Внутри – нежный сливочный сыр, сочная креветка и свежий лосось. Сверху – опалённый сыр чеддер, который придаёт насыщенность, и щедрая порция пикантного соуса шрирача для любителей острого. Идеальный выбор для тех, кто ценит яркие эмоции в каждом кусочке!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Лосось",
                            "Креветка",
                            "Соус \"шри-рача\"",
                            "Сыр чеддер"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/65bfc6f8b5c40_w900.jpg"
    },
    {
        "id":  "toki-8916-8916-filadelfiya-spicy",
        "name":  "Филадельфия SPICY",
        "description":  "Изысканный ролл для любителей ярких вкусов. Нежный опалённый лосось сочетается с сочными креветками и нежным микс-крабом, а пикантный соус спайси придаёт блюду насыщенность и лёгкую остроту. Идеальный выбор для гурманов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Микс-краб",
                            "Креветка",
                            "Соус \"Спайси\"",
                            "Лосось"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/66143e434cda6_w900.jpg"
    },
    {
        "id":  "toki-8972-8972-roll-tom-yam",
        "name":  "Ролл Том-Ям",
        "description":  "Яркий и насыщенный вкус в каждом кусочке! Внутри сочная креветка, свежий помидор и нежный сливочный сыр, обрамленные икринками масаго. Сверху — аппетитная шапочка из мидий в пикантном соусе том-ям, дополненная соусом унаги и хрустящими зернышками кунжута. Идеальное сочетание для ценителей оригинальных вкусов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Креветки",
                            "Помидоры",
                            "Сыр творожный",
                            "Икра масаго",
                            "Соус \"Том-ям\"",
                            "Мидии"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/665b9c484637d_w900.jpg"
    },
    {
        "id":  "toki-9054-9054-tigra",
        "name":  "Тигра",
        "description":  "Сочный лосось терияки в сочетании со сливочным сыром внутри создают насыщенный и нежный вкус. Снаружи ролл обвален в икринках масаго, добавляющих аппетитной текстуры. Завершает композицию пикантная шапочка из спайси соуса и хрустящая обсыпка из жареного лука фри. Идеальный выбор для тех, кто ищет яркие вкусовые акценты!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Жареный лосось",
                            "Икра масаго",
                            "Соус спайси",
                            "Лук жареный"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/66cb2998b41f0_w900.jpg"
    },
    {
        "id":  "toki-9056-9056-kotopes",
        "name":  "КотОпёс",
        "description":  "Оригинальное сочетание вкусов! Внутри – нежный сливочный сыр, свежий огурчик и воздушный омлет тамаго. Сверху – ароматный угорь под соусом унаги, золотистый кунжут и тающий во рту лосось. Настоящий праздник для ценителей необычных комбинаций!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Омлет тамаго",
                            "Лосось",
                            "Угорь",
                            "Унаги соус",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/66e2ef297ed2a_w900.jpg"
    },
    {
        "id":  "toki-9061-9061-kanada-modern",
        "name":  "Канада модерн",
        "description":  "Оригинальная канада с творожным сыром, хрустящими огурчиками и пикантной шапочкой из ароматного копченого угря и соуса \"Спайси\", посыпанного жареным кунжутом.",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурец",
                            "Угорь",
                            "Унаги соус",
                            "Кунжут",
                            "Спайси соус"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/672f4772bb860_w900.jpg"
    },
    {
        "id":  "toki-9350-9350-pikantnyi-krab",
        "name":  "Пикантный краб",
        "description":  "Изысканное сочетание вкусов, которое покорит ваше сердце! Нежный сливочный сыр, свежие хрустящие огурчики и сочный микс из краба создают гармоничную начинку. Сверху – аппетитная шапка из насыщенного сыра чеддер, который придает роллу особую пикантность. Легкая опалка добавляет тонкий аромат дымка, а соусы унаги и спайси обволакивают блюдо насыщенными сладко-пряными нотками. Этот ролл – настоящая симфония вкуса, которая подарит наслаждение с каждым кусочком!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Микс-краб",
                            "Огурцы",
                            "Унаги соус",
                            "Спайси соус",
                            "Сыр чеддр"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/67f5acc45abf9_w900.jpg"
    },
    {
        "id":  "toki-9451-9451-kanada-chizu-lait",
        "name":  "Канада ЧИЗУ лайт",
        "description":  "Нежность в каждом кусочке! Внутри – только сливочный сыр, создающий мягкий и насыщенный вкус. Снаружи – аппетитный копченый угорь, покрытый соусом унаги и посыпанный кунжутом. Идеальный выбор для истинных гурманов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/6971d9d5b8df4_w900.jpg"
    },
    {
        "id":  "toki-9477-9477-kaliforniya",
        "name":  "Калифорния",
        "description":  "Классика японской кухни! Нежный краб-микс и хрустящий огурчик, обернутый в воздушный рис и покрытый яркой икрой масаго. Идеальное сочетание вкусов и текстур для истинных гурманов!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Микс-краб",
                            "Огурцы",
                            "Икра масаго"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/69527c931b68d_w900.jpg"
    },
    {
        "id":  "toki-9479-9479-filadelfiya-lait",
        "name":  "Филадельфия лайт",
        "description":  "Легкий и изысканный вкус! Нежный сливочный сыр, свежий огурчик и тонкие ломтики охлажденного лосося. Идеальный выбор для тех, кто ценит классику и легкость!",
        "category":  "Классические роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы"
                        ],
        "price":  499,
        "emoji":  "🍣",
        "image":  "https://toki.su/__/images/menuProduct/69541682b253b_w900.jpg"
    },
    {
        "id":  "toki-8797-8797-izumi-hot",
        "name":  "Изуми HOT",
        "description":  "Гармония вкуса и текстур, которая покорит ваше сердце. Нежный сыр в сочетании со свежим огурчиком создают лёгкую основу, а изумидай, пропитанный соусом терияки, придаёт блюду утончённую сладковатую нотку. Завершающий штрих – аппетитная шапочка из пикантного спайси-соуса, которая добавляет яркости и насыщенности вкусу. Идеальное сочетание для тех, кто ценит изысканность в каждой детали.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Изумидай терияки",
                            "Творожный сыр",
                            "Огурцы",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/687e0b2e473ad_w900.jpg"
    },
    {
        "id":  "toki-8798-8798-zapechennyi-s-ugrem",
        "name":  "Запечённый с угрем",
        "description":  "Гармоничное сочетание нежного угря, сливочного сыра и свежего огурчика, завернутых в рис и нори. Снаружи ролл обвален в ароматной стружке тунца, которая придает блюду изысканный вкус. Сверху — аппетитная шапочка из чесночно-сырного соуса, покрытая ароматным соусом унаги. Идеальный выбор для ценителей насыщенных и сбалансированных вкусов!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Угорь",
                            "Творожный сыр",
                            "Огурцы",
                            "Стружка тунца",
                            "Соус \"Чесночно-сырный\"",
                            "Соус Унаги"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/687e0ad34b4e4_w900.jpg"
    },
    {
        "id":  "toki-8799-8799-zapechennaya-kaliforniya",
        "name":  "Запечённая Калифорния",
        "description":  "Классическое сочетание крабового мяса и свежего огурчика, завернутое в нежный рис и хрустящую икру тобико. Завершается блюдо аппетитной румяной шапочкой из ароматного чесночно-сырного соуса, который придает роллу насыщенный и изысканный вкус. Идеальный выбор для любителей теплых роллов!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Микс-краб",
                            "Огурцы",
                            "Соус \"Чесночно-сырный\"",
                            "Икра масаго"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/687e0a8b1742b_w900.jpg"
    },
    {
        "id":  "toki-8800-8800-zapechennyi-duet",
        "name":  "Запечённый дуэт",
        "description":  "Изысканное сочетание нежного микса краба, сочной креветки и свежего огурчика, завернутое в рис и обваленное в яркой икре масаго. Завершается ролл аппетитной румяной шапочкой из фирменного соуса, который придает блюду насыщенный вкус и неповторимую нежность. Идеальный выбор для ценителей теплых и оригинальных роллов!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Микс-краб",
                            "Креветки",
                            "Огурцы",
                            "Cоус \"Фирменный\"",
                            "Икра масаго"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/687775634a75e_w900.jpg"
    },
    {
        "id":  "toki-8801-8801-zapechennyi-s-lososem",
        "name":  "Запечённый с лососем",
        "description":  "Изысканное сочетание нежного лосося, сливочного сыра и хрустящих огурчиков. Ролл покрыт яркой обвалкой из икры масаго и завершен аппетитной шапочкой из ароматного чесночно-сырного соуса, который придает блюду насыщенный вкус и утонченную кремовую текстуру. Идеальный выбор для гурманов!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Огурец",
                            "Творожный сыр",
                            "Лосось",
                            "Cоус \"Чесночно-сырный\"",
                            "Икра масаго"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/66a4dd02bced5_w900.jpg"
    },
    {
        "id":  "toki-8803-8803-syrnyi",
        "name":  "Сырный",
        "description":  "Идеальное сочетание трех видов сыра: сливочного, чеддера и моцареллы, создающее нежную и насыщенную начинку. Сверху ролл украшен аппетитной шапочкой из чесночно-сырного соуса и полит ароматным соусом унаги для завершения вкусовой гармонии.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Сыр чеддр",
                            "Сыр моцарелла",
                            "Соус \"Чесночно-сырный\""
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/6557618c1518d_w900.jpg"
    },
    {
        "id":  "toki-8874-8874-tuna-hot",
        "name":  "Туна HOT",
        "description":  "Это настоящее гастрономическое наслаждение! Внутри сочетаются нежный сливочный сыр, свежий хрустящий огурчик и насыщенный вкус тунца, создавая идеальную гармонию. Сверху ролл украшен аппетитной шапочкой из пикантного спайси-соуса, который добавляет яркости и лёгкой остроты. Каждая порция — это взрыв вкусов и текстур, которые подарят вам незабываемые впечатления!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Творожный сыр",
                            "Огурцы",
                            "Тунец",
                            "Соус \"Cпайси\""
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/687e0aeee7e5f_w900.jpg"
    },
    {
        "id":  "toki-8878-8878-skvidvard",
        "name":  "Сквидвард",
        "description":  "Оригинальное сочетание нежного сыра, сочного микс-краба и изысканных осьминожек бэби. Ролл обвален в ароматной стружке тунца, которая придает блюду насыщенный вкус и легкую хрустящую текстуру. Завершает композицию аппетитная запеченная шапочка из пикантного соуса спайси с яркими восточными нотками. Идеальный выбор для любителей необычных вкусов!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Стружка тунца",
                            "Сыр творожный",
                            "Осьминоги БЭБИ",
                            "Микс-краб",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/65c0bc9725a99_w900.jpg"
    },
    {
        "id":  "toki-8879-8879-yakudza",
        "name":  "Якудза",
        "description":  "Изысканное сочетание морепродуктов и ярких вкусов. Нежные мидии, сочные креветки, сливочный сыр, свежий зеленый лук и спелые томаты создают гармоничную начинку. Ролл обвален в икре масаго, добавляющей легкую хрустящую текстуру. Завершает блюдо аппетитная запеченная шапочка из пикантного соуса Спайси, которая придает роллу насыщенный азиатский акцент. Настоящий гастрономический шедевр для любителей ярких и необычных вкусов!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Мидии",
                            "Сыр творожный",
                            "Креветки",
                            "Лук зеленый",
                            "Томаты",
                            "Икра масаго",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/65c0bcbd62e71_w900.jpg"
    },
    {
        "id":  "toki-8927-8927-morskoi-kokteil",
        "name":  "Морской коктейль",
        "description":  "Изысканное сочетание даров моря: мидии, бэби-осьминоги и сочные креветки. Ролл обвален в ароматном кунжуте, а завершает композицию нежная шапочка из пикантного спайси соуса, придающая блюду яркий вкус и аппетитный вид.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Мидии",
                            "Креветки",
                            "Осьминог",
                            "Соус \"Спайси\"",
                            "Кунжут"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/66148ab577a09_w900.jpg"
    },
    {
        "id":  "toki-8928-8928-krasnyi-barhat",
        "name":  "Красный бархат",
        "description":  "Изысканное сочетание нежного лосося, сочного тунца и сливочного сыра. Ролл обвален в яркой икре масаго, которая придает блюду насыщенный вкус и текстуру. Завершает композицию фирменная запеченная шапочка, добавляющая нежности и делая этот ролл настоящим гастрономическим шедевром.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось",
                            "Тунец",
                            "Сыр творожный",
                            "Соус \"Фирменный\"",
                            "Икра масаго красная",
                            "оранжевая",
                            "зеленая или черная"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/66148bb7b0f73_w900.jpg"
    },
    {
        "id":  "toki-9014-9014-midiinyi",
        "name":  "Мидийный",
        "description":  "Изысканное сочетание нежного сыра и свежих огурчиков, завернутых в яркий маменори. Сверху аппетитная шапочка из чесночно-сырного соуса, украшенная аппетитной мидией, а финальный штрих — ароматный соус унаги, придающий блюду насыщенный вкус. Идеальный выбор для ценителей необычных сочетаний!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Маминори",
                            "Огурцы",
                            "Сыр творожный",
                            "Соус чесночный",
                            "Мидии",
                            "Унаги соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/678a28e2c4e31_w900.jpg"
    },
    {
        "id":  "toki-9055-9055-koluchii",
        "name":  "Колючий",
        "description":  "Гармоничное сочетание нежного лосося терияки, сливочного сыра и свежего огурчика, завернутых в рис и нори. Снаружи ролл обвален ароматной стружкой тунца, добавляющей пикантности. Сверху — румяная шапочка из чесночно-сырного соуса, щедро покрытая соусом унаги и посыпанная золотистым кунжутом. Идеальный выбор для ценителей ярких вкусов и текстур!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось жареный",
                            "Сыр творожный",
                            "Кунжут",
                            "Стружка тунца",
                            "Унаги соус",
                            "Чесночно-сырный соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/687e0aaf65c47_w900.jpg"
    },
    {
        "id":  "toki-9085-9085-kalmar-hot",
        "name":  "Кальмар HOT",
        "description":  "Гармония вкуса и текстур, которая покорит ваше сердце. Нежный сыр в сочетании со свежим огурчиком создают лёгкую основу, а ароматный копченый кальмар придаёт блюду утончённую солено-сладковатую нотку. Завершающий штрих – аппетитная шапочка из пикантного спайси-соуса, которая добавляет яркости и насыщенности вкусу. Идеальное сочетание для тех, кто ценит изысканность в каждой детали.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Кальмар Х/К",
                            "Спайси соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/6788d91d0af4a_w900.jpg"
    },
    {
        "id":  "toki-9086-9086-kurochka-hot",
        "name":  "Курочка HOT",
        "description":  "Гармония вкуса и текстур, которая покорит ваше сердце. Нежный сыр в сочетании со свежим огурчиком создают лёгкую основу, а копченая курочка, придаёт блюду утончённую солено-сладковатую нотку. Завершающий штрих – аппетитная шапочка из фирменного соуса, которая добавляет яркости и насыщенности вкусу. Идеальное сочетание для тех, кто ценит изысканность в каждой детали.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Курица Х/К",
                            "Фирменный соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/6788e0a3ac796_w900.jpg"
    },
    {
        "id":  "toki-9089-9089-shrimp-roll",
        "name":  "Шримп ролл",
        "description":  "Нежная начинка из сливочного сыра, сочной креветки и микс-краба, завернутая в рис и обваленная в икре масаго. Сверху ролл украшен ароматной, запечнной до золотистой корочки, шапочкой из чесночно-сырного соуса, полит насыщенным соусом унаги и посыпан обжаренным кунжутом для создания гармоничного вкуса и текстуры. Идеальный выбор для любителей изысканных сочетаний!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Креветки",
                            "Микс-краб",
                            "Икра Масаго",
                            "Унаги",
                            "Кунжут",
                            "Чесночно-сырный соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/6788ebb008023_w900.jpg"
    },
    {
        "id":  "toki-9091-9091-zapechennaya-cypa",
        "name":  "Запеченная цыпа",
        "description":  "Нежное сочетание вкусов в каждом кусочке! Внутри ролла скрывается мягкий сливочный сыр, сочная копченая курочка и сладкий болгарский перец, которые гармонично дополняют друг друга. Снаружи ролл покрыт хрустящей обсыпкой из белого кунжута, а сверху украшен воздушной шапочкой из ароматного чесночно-сырного соуса. Завершают композицию изысканный соус унаги и утонченная посыпка из черно-белого кунжута. Этот ролл — идеальное сочетание нежности, аромата и легкой пикантности, созданное для истинных ценителей.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Курица Х/К",
                            "Перец болгарский",
                            "Кунжут",
                            "Чесночно-сырный соус",
                            "Унаги соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/67f5b16f26a39_w900.jpg"
    },
    {
        "id":  "toki-9092-9092-zapechennyi-kalmar",
        "name":  "Запеченный кальмар",
        "description":  "Погрузитесь в мир изысканных вкусов с нашим аппетитным запеченным роллом \"Запеченный кальмар\". Внутри скрываются нежный сливочный сыр, ароматный копченый кальмар и сочные кусочки свежего помидора — гармония текстур и вкусов в каждом кусочке. Ролл покрыт воздушной шапочкой из насыщенного чесночно-сырного соуса, который тает во рту, а изысканный соус унаги добавляет приятную сладковато-соленую нотку. Завершающий штрих — посыпка из черного и белого кунжута, которая не только подчеркивает вкус, но и придает блюду элегантный вид. Этот ролл станет настоящим украшением вашего стола и подарит незабываемое гастрономическое наслаждение!",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Кальмар Х/К",
                            "Томат",
                            "Кунжут",
                            "Чесночно-сырный соус",
                            "Унаги соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/67f5b2dab5049_w900.jpg"
    },
    {
        "id":  "toki-9352-9352-ebi-hot",
        "name":  "Эби HOT",
        "description":  "Погрузитесь в мир ярких вкусов с нашим запеченным роллом \"Эби HOT\"! Внутри скрывается нежный сливочный сыр, хрустящие свежие огурчики и сочные креветки, которые создают изысканное сочетание. Сверху ролл покрыт аппетитной шапочкой из пикантного соуса спайси, который придает легкую остринку, а соус унаги добавляет насыщенные сладковато-соленые нотки. Завершающий штрих – ароматная посыпка из сыра пармезан, который плавится и обволакивает ролл, создавая невероятно аппетитный вид и насыщенный вкус.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Креветка",
                            "Сыр пармезан",
                            "Унаги соус",
                            "Спайси соус"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/67f5affc034ab_w900.jpg"
    },
    {
        "id":  "toki-9353-9353-dzen",
        "name":  "Дзен",
        "description":  "Погрузитесь в гармонию вкусов с нашим изысканным запеченным роллом \"Дзен\". Внутри — нежный сливочный сыр, сочный лосось и деликатные креветки, которые создают идеальный баланс текстур. Сверху ролл покрыт воздушной шапочкой из ароматного чесночно-сырного соуса, который придает блюду насыщенность и утонченность. Завершают композицию сладковато-соленый соус унаги и изящная посыпка из черного и белого кунжута, добавляющая легкую пикантную нотку. Этот ролл — настоящее воплощение вкусового баланса и эстетического наслаждения, созданное для истинных гурманов.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Креветки",
                            "Лосось",
                            "Соус унаги",
                            "Кунжут",
                            "Соус чесночно-сырный"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/67f5b43cb4de0_w900.jpg"
    },
    {
        "id":  "toki-9411-9411-ogon",
        "name":  "Огонь",
        "description":  "Ролл «Огонь» — тёплый запечённый ролл с нежным лососем, сладковатым томаго и сочным томатом, покрытый пикантной шапкой спайси, полит карамельно‑соевым соусом унаги и посыпан хрустящими рисовым шариками.",
        "category":  "Запеченные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось",
                            "Омлет",
                            "Томат",
                            "Соус спайси",
                            "Соус унаги",
                            "Рисовые шарки"
                        ],
        "price":  499,
        "emoji":  "🔥",
        "image":  "https://toki.su/__/images/menuProduct/68b718aca9641_w900.jpg"
    },
    {
        "id":  "toki-8782-8782-ebi-tempura",
        "name":  "Эби темпура",
        "description":  "Жареный ролл с сочной креветкой и нежным сливочным сыром, обжаренный в хрустящей темпуре и покрытый пикантным соусом спайси. Идеальное сочетание яркого вкуса и аппетитной текстуры!",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Креветки",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/689a5f0f471ad_w900.jpg"
    },
    {
        "id":  "toki-8783-8783-tempura-s-ugrem",
        "name":  "Темпура с угрём",
        "description":  "Жареный ролл с нежным угрем, сливочным сыром и свежим огурчиком, обжаренный в хрустящей темпуре и покрытый ароматным соусом унаги. Идеальное сочетание насыщенного вкуса и аппетитной текстуры!",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Угорь",
                            "Огурцы",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/687e0b8645f59_w900.jpg"
    },
    {
        "id":  "toki-8790-8790-tempura-skazka",
        "name":  "Темпура Сказка",
        "description":  "Жареный ролл с нежным лососем и мягким сливочным сыром, обжаренный в хрустящей темпуре и украшенный ароматным соусом унаги. Аппетитное сочетание для истинного наслаждения!",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Сухарики панко",
                            "Кляр",
                            "Сойс \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/65564c9ff0021_w900.jpg"
    },
    {
        "id":  "toki-8791-8791-tempura-s-lososem",
        "name":  "Темпура с лососем",
        "description":  "Жареный ролл с сочным лососем, нежным сливочным сыром и свежим огурчиком, обжаренный в хрустящей темпуре и дополненный пикантным соусом спайси. Яркий вкус и насыщенная текстура в каждом кусочке!",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/687e0b9debdd3_w900.jpg"
    },
    {
        "id":  "toki-8792-8792-korolevskaya-tempura",
        "name":  "Королевская темпура",
        "description":  "Жареный ролл с нежным лососем, сочным микс-крабом и свежим огурчиком. Обжарен до хрустящей корочки и дополнен ароматным соусом унаги для насыщенного вкуса.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Микс-краб",
                            "Лосось",
                            "Огурцы",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/65564b46718b5_w900.jpg"
    },
    {
        "id":  "toki-8793-8793-tempura-s-kurochkoi",
        "name":  "Темпура с курочкой",
        "description":  "Жареный ролл с копченой курочкой, нежным сливочным сыром и свежим огурчиком. Хрустящая корочка и ароматный соус унаги придают блюду насыщенный вкус и аппетитный вид.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Копчёная курица",
                            "Огурцы",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/65564a6d10f3f_w900.jpg"
    },
    {
        "id":  "toki-8880-8880-tempura-miks",
        "name":  "Темпура Микс",
        "description":  "Жареный ролл с нежным лососем, сочными креветками и аппетитным микс-крабом. Обжарен в хрустящей темпуре и щедро полит ароматным соусом унаги. Идеальное сочетание вкусов и текстур для истинных гурманов!",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Креветки",
                            "Лосось",
                            "Микс-краб",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/65bf9cdbd327e_w900.jpg"
    },
    {
        "id":  "toki-8881-8881-tempura-s-osminogom",
        "name":  "Темпура с осьминогом",
        "description":  "Жареный ролл с хрустящими осьминожками бэби в соусе терияки, нежным сливочным сыром и свежим огурчиком. Завершает вкус аппетитная глазурь из соуса унаги, придающая блюду яркий аромат и изысканность.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Осьминог",
                            "Огурец",
                            "Сыр творожный",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/65bf9e431f345_w900.jpg"
    },
    {
        "id":  "toki-8883-8883-tempura-skviddi",
        "name":  "Темпура Сквидди",
        "description":  "Жареный ролл с копченым кальмаром, нежным сливочным сыром и хрустящим перчиком. Завершается ярким акцентом соуса унаги и ароматным жареным кунжутом, добавляющего блюду насыщенный вкус.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Кальмар Х/К",
                            "Болгарский перчик",
                            "Сыр творожный",
                            "Соус Унаги",
                            "Кунжут",
                            "Сухарики панко",
                            "Кляр"
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/690c7238a07b2_w900.jpg"
    },
    {
        "id":  "toki-8884-8884-tempura-fortuna",
        "name":  "Темпура forTUNA",
        "description":  "Хрустящий жареный ролл с нежным тунцом, сливочным сыром и свежими огурчиками, покрытый ароматным соусом унаги. Идеальное сочетание вкусов для настоящих гурманов!",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Тунец",
                            "Огурцы",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/65bfa13e53542_w900.jpg"
    },
    {
        "id":  "toki-8901-8901-tempura-salmon-spicy",
        "name":  "Темпура Salmon SPICY",
        "description":  "Жареный ролл с аппетитным лососем терияки, нежным микс-крабом и свежим зеленым лучком. Сверху ролл покрыт пикантным соусом спайси и хрустящим жареным луком фри, создавая яркое сочетание вкусов и текстур.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось жареный",
                            "Микс-краб",
                            "Лук зеленый",
                            "Лук жареный",
                            "Соус \"Спайси\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/6778fc249eca8_w900.jpg"
    },
    {
        "id":  "toki-8923-8923-tempura-kaliforniya",
        "name":  "Темпура Калифорния",
        "description":  "Хрустящая корочка в сочетании с нежным микс-крабом, икринками масаго и свежим огурчиком. Полит ароматным соусом унаги для насыщенного вкуса.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Микс-краб",
                            "Огурцы",
                            "Икра масаго",
                            "Соус \"Унаги\""
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/661472721ab69_w900.jpg"
    },
    {
        "id":  "toki-8926-8926-midiinaya-tempura",
        "name":  "Мидийная Темпура",
        "description":  "Жареный ролл с нежными мидиями, спелыми томатами, ароматным зеленым лучком и омлетом томаго, обжаренный до золотистой корочки. Дополнен фирменным соусом в тандеме со сладким соусом унаги и хрустящим жареным луком, придают блюду незабываемы вкус и аромат.",
        "category":  "Жареные роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Мидии",
                            "Омлет",
                            "Лук зеленый",
                            "Томат",
                            "Соус Фирменный",
                            "Соус Унаги",
                            "Лук жареный"
                        ],
        "price":  499,
        "emoji":  "🍤",
        "image":  "https://toki.su/__/images/menuProduct/68b18b103be68_w900.jpg"
    },
    {
        "id":  "toki-8795-8795-tempuran-s-krevetkoi",
        "name":  "ТемпуРАН с креветкой",
        "description":  "Жареный ролл с нежным сливочным сыром и хрустящим огурчиком внутри, увенчанный аппетитной шапочкой из сочного замеса креветки, ароматного зеленого лука и пикантного соуса спайси. Завершается блюдо изысканной глазурью соуса унаги – насыщенный вкус в каждой детали!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Огурцы",
                            "Креветки",
                            "Лук зеленый",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Спайси\"",
                            "Соус \"Унаги\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6556432d3ba17_w900.jpg"
    },
    {
        "id":  "toki-8802-8802-zapechennaya-filadelfiya",
        "name":  "Запечённая филадельфия",
        "description":  "Нежный ролл с мягким сливочным сыром, хрустящим огурчиком и свежим лососем. Запекание придает блюду насыщенный вкус и аппетитную золотистую корочку. Завершается композиция ароматным унаги соусом, который добавляет легкую сладость и изысканную глубину вкуса. Идеальное сочетание для любителей теплых роллов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Огурцы",
                            "Лосось",
                            "Соус \"Унаги\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6557608af0a4f_w900.jpg"
    },
    {
        "id":  "toki-8820-8820-filadelfiya",
        "name":  "Филадельфия",
        "description":  "Классическое сочетание нежного сливочного сыра, свежего огурчика и охлажденного лосося. Идеальный баланс вкусов и текстур для истинных гурманов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/687e0976d92b5_w900.jpg"
    },
    {
        "id":  "toki-8821-8821-fila-chizu",
        "name":  "Фила Чизу",
        "description":  "Нежное сочетание свежего лосося, мягкого сливочного сыра и воздушного японского риса. Идеальный выбор для любителей классических роллов с изысканным сливочным акцентом!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Охлажденный лосось"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6559e4806fc77_w900.jpg"
    },
    {
        "id":  "toki-8822-8822-karamelnaya-filadelfiya",
        "name":  "Карамельная филадельфия",
        "description":  "Изысканный вариант классического ролла \"Филадельфия\". Нежный сливочный сыр, хрустящий огурчик и свежий рис сочетаются с опалённым лососем, который приобретает лёгкий аромат гриля. Завершается блюдо тонким карамельным топпингом и щепоткой морской соли, создавая гармонию сладкого и солёного вкусов. Идеальный выбор для ценителей утончённых кулинарных решений!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Топпинг карамельный",
                            "Соль морская"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6559e551138a6_w900.jpg"
    },
    {
        "id":  "toki-8824-8824-opalennaya-filadelfiya",
        "name":  "Опаленная филадельфия",
        "description":  "Изысканный ролл с нежным сливочным сыром, свежими огурчиками и опаленным лососем. Завершается блюдо ярким тропическим акцентом — соусом манго-маракуйя, который добавляет утончённую остро-кислую нотку. Идеальное сочетание для ценителей необычных вкусов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Соус \"Манго\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/687e0a4aea2a0_w900.jpg"
    },
    {
        "id":  "toki-8828-8828-kanada",
        "name":  "Канада",
        "description":  "Это классика с изысканным вкусом! Нежный сливочный сыр, свежий огурчик и аппетитный охлажденный лосось гармонично сочетаются внутри. Сверху ролл покрыт нежными ломтиками копченого угря, политыми ароматным соусом унаги и посыпанными кунжутом. Идеальный выбор для ценителей утонченной японской кухни!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "кунжут"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/687e09a9426c8_w900.jpg"
    },
    {
        "id":  "toki-8830-8830-kanada-chizu",
        "name":  "Канада Чизу",
        "description":  "Нежность в каждом кусочке! Внутри – только сливочный сыр, создающий мягкий и насыщенный вкус. Снаружи – аппетитный копченый угорь, покрытый соусом унаги и посыпанный кунжутом. Идеальный выбор для истинных гурманов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6559f5353023b_w900.jpg"
    },
    {
        "id":  "toki-8833-8833-slivochnyi-duet",
        "name":  "Сливочный дуэт",
        "description":  "Изысканное сочетание нежного сливочного сыра и свежего огурчика внутри. Сверху – тающий во рту лосось и ароматный угорь, покрытые соусом унаги и посыпанные золотистым кунжутом. Идеальный баланс вкусов для истинных ценителей!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Лосось",
                            "Огурцы",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6559fa6d0898f_w900.jpg"
    },
    {
        "id":  "toki-8845-8845-ebi-roll",
        "name":  "Эби ролл",
        "description":  "Нежный сливочный сыр и свежий хрустящий огурчик внутри, а сверху сочная креветка под пикантным соусом манго-маракуйя. Легкий, освежающий вкус с яркими тропическими нотками. Идеальный выбор для ценителей оригинальных сочетаний!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки",
                            "Творожный сыр",
                            "Огурцы",
                            "Соус \"Манго-Маракуйя\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/655a11e6a5ea3_w900.jpg"
    },
    {
        "id":  "toki-8895-8895-tuna-green",
        "name":  "Туна GREEN",
        "description":  "Ролл для любителй морепродуктов и оригинальных сочетаний вкусов. Начинака из творожного сыра, хрустящих тигровых креветок и охлажденного лосося под шапочкой из вкуснейшего тунца и соусов \"Унаги\" и \"Сливочный васаби\".",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Креветки",
                            "Лосось",
                            "Тунец",
                            "Соус \"Унаги\"",
                            "Соус \"Васаби\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/65c0d85308061_w900.jpg"
    },
    {
        "id":  "toki-8910-8910-legenda",
        "name":  "Легенда",
        "description":  "Изысканное сочетание вкусов: нежный сливочный сыр, сочная креветка и свежий болгарский перец создают гармоничную начинку. Сверху ролл украшен аппетитной шапочкой из нежного лосося и пикантного чесночно-сырного соуса, который придает блюду особую насыщенность. Легкая запеченная корочка делает этот ролл настоящей кулинарной легендой!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Креветки",
                            "Перец болгарский",
                            "Лосось",
                            "Соус \"Чесночно-сырный\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/660de6be2b48f_w900.jpg"
    },
    {
        "id":  "toki-8919-8919-morris",
        "name":  "Моррис",
        "description":  "Изысканное сочетание морских даров и экзотических вкусов! Нежный тунец, сочный лосось и деликатный гребешок создают гармонию внутри ролла. Сверху он покрыт пикантным соусом манго-маракуйя, который добавляет яркие тропические нотки и легкую сладость. Идеальный выбор для тех, кто ценит утонченность и оригинальность!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Тунец",
                            "Лосось",
                            "Гребешок",
                            "Соус \"Манго-маракуйя\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/66c62e915b9b6_w900.jpg"
    },
    {
        "id":  "toki-8929-8929-luks",
        "name":  "ЛЮКС",
        "description":  "Роскошное сочетание премиальных ингредиентов: нежный лосось, сочный тунец, ароматный угорь, микс-краб и изумидай в соусе терияки. Ролл обвален в яркой икре масаго, которая добавляет текстуру и насыщенный вкус. Завершает блюдо аппетитная запеченная шапочка из пикантного соуса спайси, придающая изысканную остроту и восточные нотки. Настоящее наслаждение для гурманов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось",
                            "Тунец",
                            "Угорь",
                            "Микс-краб",
                            "Изумидай терияки",
                            "Соус \"Спайси\"",
                            "Икра масаго"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/66148cb97d2cb_w900.jpg"
    },
    {
        "id":  "toki-8957-8957-kanada-big",
        "name":  "Канада БИГ",
        "description":  "Увеличенная версия любимой классики! Внутри – нежный сливочный сыр, свежий огурчик и сочный лосось. Снаружи – аппетитный копченый угорь, покрытый ароматным соусом унаги и посыпанный кунжутом. Максимум вкуса и удовольствия в каждом большом кусочке!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Лосось",
                            "Угорь",
                            "Соус \"Унаги\"",
                            "Кунжут"
                        ],
        "price":  899,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6657259b26d92_w900.jpg"
    },
    {
        "id":  "toki-8971-8971-pop-korn",
        "name":  "Поп-Корн",
        "description":  "Взрыв вкусов и текстур! Внутри сочный микс из микс-краба, лосося и нежного риса. Снаружи ролл покрыт хрустящими пикантными рисовыми шариками КимЧи, добавляющими яркий акцент. Завершает композицию аппетитная шапочка из замеса лосося, тунца и ароматного спайси-соуса. Этот ролл станет настоящим открытием для гурманов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Микс-краб",
                            "Лосось",
                            "Рисовые шарики КимЧИ",
                            "Тунец",
                            "Соус \"Спайси\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/665b9b5583352_w900.jpg"
    },
    {
        "id":  "toki-9048-9048-drakon",
        "name":  "Дракон",
        "description":  "Изысканное сочетание вкусов и текстур! Нежный сыр, свежие огурчики и воздушный омлет томаго создают гармоничную основу, а сверху ролл украшен аппетитным угрем, покрытым ароматным соусом унаги и посыпанным кунжутом. Идеальный выбор для любителей ярких и насыщенных вкусов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Омлет",
                            "Унаги соус",
                            "Кунжут",
                            "Угорь"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/66c5e15876f73_w900.jpg"
    },
    {
        "id":  "toki-9082-9082-tempuran-s-tuncom",
        "name":  "ТемпуРАН с тунцом",
        "description":  "Жареный ролл с нежным сливочным сыром и свежим огурчиком внутри, украшенный аппетитной шапочкой из замеса тунца, зеленого лука и пикантного соуса спайси. Завершается блюдо ароматной глазурью соуса унаги – настоящее наслаждение для ценителей ярких вкусов!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Творожный сыр",
                            "Огурцы",
                            "Тунец",
                            "Лук зеленый",
                            "Сухарики панко",
                            "Кляр",
                            "Соус \"Спайси\"",
                            "Соус \"Унаги\""
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/6786355e00cf6_w900.jpg"
    },
    {
        "id":  "toki-9347-9347-chudo",
        "name":  "Чудо",
        "description":  "Настоящий гастрономический шедевр, который оправдывает свое название! Внутри нежный сливочный сыр, хрустящие свежие огурчики и креветки в хрустящей темпуре. Сверху – аппетитная шапка из лосося, половина которой слегка опалена до золотистой корочки, что придает блюду изысканный аромат. Завершающий акцент – утонченный соус манго-маракуйя, добавляющий яркие тропические нотки. Этот ролл – идеальное сочетание текстур и вкусов, которое оставит незабываемое впечатление!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Креветка темпура",
                            "Огурцы",
                            "Манго-маракуйя соус",
                            "Лосось"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/67f5a86280bda_w900.jpg"
    },
    {
        "id":  "toki-9409-9409-tempura-morskoe-assorti",
        "name":  "Темпура Морское Ассорти",
        "description":  "Жареный ролл «Морское ассорти»: нежные кусочки лосося, сочная креветка и благородный тунец в хрустящей золотистой оболочке. Финальный акцент — сладковато-солёный соус унаги и кремовый ореховый соус, сверху — хрустящие рисовые шарики для текстурного контраста. Идеальное сочетание морских вкусов и хруста.",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Лосось",
                            "Креветка",
                            "Тунец",
                            "Ореховый соус",
                            "Шарики рисовые",
                            "Унаги соус"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/68b7084da5d59_w900.jpg"
    },
    {
        "id":  "toki-9410-9410-tempura-jemchujina-okeana",
        "name":  "Темпура Жемчужина Океана",
        "description":  "Жемчужина Океана — хрустящая золотистая оболочка, внутри — сочный гребешок, мягкий сливочный сыр и свежий зелёный лук. Ролл завершается ярким манго‑маракуйя соусом и ароматным кунжутом — освежающее сочетание тропической сладости и морской нежности.",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Нори",
                            "Гребешок",
                            "Сыр творожный",
                            "Лук зеленый",
                            "Соус манго маракуйя",
                            "Кунжут"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/68b70a26bc690_w900.jpg"
    },
    {
        "id":  "toki-9412-9412-dary-morya",
        "name":  "Дары моря",
        "description":  "Запечённый ролл «Дары моря» — синергия морских деликатесов: нежный лосось, насыщенный тунец и тающий гребешок аккуратно свернуты в рис и нори нежной запечённой шапкой фирменного соуса. Ролл украшен струйками сладково‑кармельного унаги и тёртым пармезаном, а обсыпка из масаго добавляет яркий цвет и хрустящую текстуру. Гармония вкусов и текстур в каждом укусе.",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось",
                            "Тунец",
                            "Гребешок",
                            "Соус фирменный",
                            "Соус унаги",
                            "Сыр пармезан",
                            "Икра масаго"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/68b71a279008f_w900.jpg"
    },
    {
        "id":  "toki-9413-9413-gurman",
        "name":  "Гурман",
        "description":  "Запечённый ролл «Гурман» — роскошное сочетание текстур и ароматов: нежный угорь, плотный тунец и сладкая креветка аккуратно завернуты в рис и нори, под запечённой шапкой фирменного соуса. Ролл полит карамельно‑дымным унаги и бархатистым ореховым соусом, сверху хрустят воздушные рисовые шарики, а внешняя обсыпка из стружки тунца добавляет солёно‑умами нотку и эффектный вид. Идеален для тех, кто любит глубокие насыщенные вкусы и контраст текстур в каждом укусе.",
        "category":  "VIP роллы",
        "ingredients":  [
                            "рис",
                            "Нори",
                            "Креветка",
                            "Тунец",
                            "Угорь",
                            "Соус фирменный",
                            "Соус унаги",
                            "Стружка тунца",
                            "Соус ореховый",
                            "Рисовые шарки"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/68b71bf54a78a_w900.jpg"
    },
    {
        "id":  "toki-9414-9414-bogema",
        "name":  "Богема",
        "description":  "Ролл «Богема» — утончённое сочетание моря и тропиков: сочный лосось, карамелизованный угорь и плотный тунец аккуратно свернуты в рис и нори, а сверху венчает нежная шапка из свежих креветок. Ролл щедро облит бархатистым сливочно‑васаби, который дарит мягкую остроту, и ярким манго‑маракуйя соусом с тропической кислинкой. Финальный штрих — обжаренный кунжут, который добавляет ароматную хрустящую ноту и делает подачу по‑настоящему элегантной. Идеален для тех, кто ценит контраст текстур и свежие, выразительные вкусы.",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Тунец",
                            "Лосось",
                            "Угорь",
                            "Креветки",
                            "Кунжут",
                            "Соус васаби",
                            "Соус манго-маракуйя"
                        ],
        "price":  899,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/68b72b6200e89_w900.jpg"
    },
    {
        "id":  "toki-9415-9415-chizzichiz",
        "name":  "ЧиззиЧиз",
        "description":  "Ролл «ЧиззиЧиз» — гармония лёгкости и бархатистости: свежий лосось и хрустящий огурец сочетаются с деликатной креветкой внутри, а сверху лежит нежная шапка из творожного сыра, которая придаёт мягкую кремовую текстуру и нежную кислинку. Сливочно‑васаби добавляет тонкую острую нотку, а обсыпка из икринок масаго дарит пикантный морской привкус и аккуратную икриную хрустящую текстуру. Эффектная подача и контраст текстур делают этот ролл лучшим выбором для любителей мягких сырных сочетаний с морскими вкусами.",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось",
                            "Креветка",
                            "Огурец",
                            "Сыр творожный",
                            "Соус васаби",
                            "Масаго"
                        ],
        "price":  699,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/68b72fb778b0f_w900.jpg"
    },
    {
        "id":  "toki-9488-9488-filadelfiya-big",
        "name":  "Филадельфия БИГ",
        "description":  "Увеличенная версия всеми любимой классики! Щедрый слой нежного охлажденного лосося, сливочный сыр и свежий огурчик в сочетании с идеально приготовленным рисом создают насыщенный вкус и дарят максимум удовольствия. Для тех, кто хочет больше вкуса и удовольствия в каждом кусочке!",
        "category":  "VIP роллы",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Сыр творожный",
                            "Огурцы",
                            "Лосось"
                        ],
        "price":  899,
        "emoji":  "👑",
        "image":  "https://toki.su/__/images/menuProduct/697b37277a5fb_w900.jpg"
    },
    {
        "id":  "toki-8785-8785-syake-maki",
        "name":  "Сяке маки",
        "description":  "Классический ролл с нежным филе свежего лосося, обернутым в воздушный рис и лист нори",
        "category":  "Маки",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Лосось"
                        ],
        "price":  349,
        "emoji":  "🍙",
        "image":  "https://toki.su/__/images/menuProduct/687e0be495294_w900.jpg"
    },
    {
        "id":  "toki-8786-8786-unagi-maki",
        "name":  "Унаги маки",
        "description":  "Изысканный ролл с нежным копченым угрем, обернутым в воздушный рис и лист нори. Угорь придает блюду насыщенный вкус с легкими сладковатыми нотками, которые идеально дополняются соусом унаги и ароматным кунжутом.",
        "category":  "Маки",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Угорь",
                            "Соус \"унаги\"",
                            "Кунжут"
                        ],
        "price":  349,
        "emoji":  "🍙",
        "image":  "https://toki.su/__/images/menuProduct/687e0bd22c088_w900.jpg"
    },
    {
        "id":  "toki-8787-8787-kappa-maki",
        "name":  "Каппа маки",
        "description":  "Капа маки — это ролл, в который завернуты кусочки свежего огурчика. В сочетании с нори и рисом, ролл обладает легким и освежающим вкусом.",
        "category":  "Маки",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Огурец"
                        ],
        "price":  249,
        "emoji":  "🍙",
        "image":  "https://toki.su/__/images/menuProduct/687e0bf42d11f_w900.jpg"
    },
    {
        "id":  "toki-8788-8788-ebi-maki",
        "name":  "Эби маки",
        "description":  "Изысканный ролл, с нежными хрустящими креветками, обернутыми в рис и лист нори. Этот ролл сочетает в себе мягкий вкус морепродуктов и легкую пикантность \"Спайси\" соуса.",
        "category":  "Маки",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Креветки",
                            "Соус \"Спайси\""
                        ],
        "price":  349,
        "emoji":  "🍙",
        "image":  "https://toki.su/__/images/menuProduct/6558884d7f746_w900.jpg"
    },
    {
        "id":  "toki-8908-8908-kaliforniya-maki",
        "name":  "Калифорния маки",
        "description":  "Нежный ролл с рисом и нори, наполненный имитацией крабового мяса. Идеальный выбор для тех, кто хочет насладиться вкусом суши в легкой и освежающей интерпретации.",
        "category":  "Маки",
        "ingredients":  [
                            "Нори",
                            "Рис",
                            "Микс-краб"
                        ],
        "price":  249,
        "emoji":  "🍙",
        "image":  "https://toki.su/__/images/menuProduct/660de47ff28b1_w900.jpg"
    },
    {
        "id":  "toki-8931-8931-yaki-maki-pod-spaisi",
        "name":  "Яки маки под спайси-соусом и c начинкой на выборр",
        "description":  "Запеченный маки-ролл под аппетитной шапочкой из пикантного спайси соуса. Внутри — начинка на ваш выбор, идеально сочетающаяся с нежной текстурой и насыщенным вкусом. Настоящее удовольствие для ценителей ярких вкусов!",
        "category":  "Запеченные маки",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Соус \"Спайси\"",
                            "Начинка на выбор (лосось",
                            "угорь",
                            "тунец",
                            "кальмар",
                            "курица",
                            "креветки)"
                        ],
        "price":  399,
        "emoji":  "♨️",
        "image":  "https://toki.su/__/images/menuProduct/66267839466d5_w900.jpg"
    },
    {
        "id":  "toki-8945-8945-yaki-maki-pod-firmennym",
        "name":  "Яки маки под фирменным соусом и c начинкой на выбор",
        "description":  "Запечённый маки-ролл под румяной шапочкой из фирменного соуса (майонез и икра масаго). Нежная начинка на ваш выбор в сочетании с насыщенным вкусом соуса создаёт гармонию вкусов и истинное удовольствие.",
        "category":  "Запеченные маки",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Соус \"Фирменный\"",
                            "Начинка на выбор (лосось",
                            "угорь",
                            "тунец",
                            "кальмар",
                            "курица",
                            "креветки)"
                        ],
        "price":  399,
        "emoji":  "♨️",
        "image":  "https://toki.su/__/images/menuProduct/6978a1fd0b036_w900.jpg"
    },
    {
        "id":  "toki-8946-8946-yaki-maki-pod-chesnochno",
        "name":  "Яки маки под Чесночно-Сырным соусом и c начинкой на выбор",
        "description":  "Запеченный ролл с нежной чесночно-сырной шапочкой, под которой скрывается начинка на ваш выбор. Идеальное сочетание насыщенного ароматного соуса и вашего любимого наполнения.",
        "category":  "Запеченные маки",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Соус \"Чесночно-Сырный\"",
                            "Начинка на выбор (лосось",
                            "угорь",
                            "тунец",
                            "кальмар",
                            "курица",
                            "креветки)"
                        ],
        "price":  399,
        "emoji":  "♨️",
        "image":  "https://toki.su/__/images/menuProduct/6627f4c79b9da_w900.jpg"
    },
    {
        "id":  "toki-8958-8958-pikantnyi",
        "name":  "Пикантный",
        "description":  "Ролл с тунцом, творожным сыром, зеленым лучком, в обсыпке из жареного кунжута.",
        "category":  "Все по 399 рублей",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Тунец",
                            "Лук зеленый",
                            "Сыр творожный",
                            "Кунжут"
                        ],
        "price":  399,
        "emoji":  "💸",
        "image":  "https://toki.su/__/images/menuProduct/665729d3e084d_w900.jpg"
    },
    {
        "id":  "toki-8986-8986-lukovyi-cyplenok",
        "name":  "Луковый цыпленок",
        "description":  "Ролл с курочкой и творожным сыром. Подается под вкусным французским майонезом\" и обсыпке из жареного лука.",
        "category":  "Все по 399 рублей",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Курица х/к",
                            "Сыр творожный",
                            "Майонез французский",
                            "Лук жареный"
                        ],
        "price":  399,
        "emoji":  "💸",
        "image":  "https://toki.su/__/images/menuProduct/66840e4c9b3ee_w900.jpg"
    },
    {
        "id":  "toki-9034-9034-cypa-s-omletom",
        "name":  "Цыпа с омлетом",
        "description":  "Ролл с омлетом томаго, томатами, копченой курочкой и творожным сыром. Подается под вкусным французским майонезом.",
        "category":  "Все по 399 рублей",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Омлет томаго",
                            "Курица Х/К",
                            "Томат",
                            "Сыр творожный",
                            "Майонез французский"
                        ],
        "price":  399,
        "emoji":  "💸",
        "image":  "https://toki.su/__/images/menuProduct/66a63adc02a45_w900.jpg"
    },
    {
        "id":  "toki-9041-9041-zapechennyi-muss",
        "name":  "Запеченный Мусс",
        "description":  "Запеченный ролл с микс-крабом, огурчиками и зеленым луком. Под шапочкой мусом из спайси соуса и охлажденного лосося. ВАЖНО: не приезжает горячим.",
        "category":  "Все по 399 рублей",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Огурец",
                            "Микс-краб",
                            "Лук зеленый",
                            "Кунжут",
                            "Соус унаги",
                            "Лосось терияки",
                            "Соус Спайси"
                        ],
        "price":  399,
        "emoji":  "💸",
        "image":  "https://toki.su/__/images/menuProduct/66b5f9d571f0f_w900.jpg"
    },
    {
        "id":  "toki-9487-9487-taiskii",
        "name":  "Тайский",
        "description":  "Ролл Тайский - начинка из лосося терияки, творожного сыра и хрустящих огурчиков. Подается с пикантным соусом Том-Ям и ароматным кунжутом.",
        "category":  "Все по 399 рублей",
        "ingredients":  [
                            "Рис",
                            "Нори",
                            "Лосось жареный",
                            "Огурцы",
                            "Сыр творожный",
                            "Соус \"том-ям\"",
                            "Кунжут"
                        ],
        "price":  399,
        "emoji":  "💸",
        "image":  "https://toki.su/__/images/menuProduct/697b34eadd08f_w900.jpg"
    },
    {
        "id":  "toki-8850-8850-set-zapechennyi",
        "name":  "Сет Запечённый",
        "description":  "Сет «Запеченный» — изысканное сочетание нежных вкусов и аппетитной запеченной корочки! В составе: запеченный с угрем, запеченный дуэт и запеченный с лососем. Каждая позиция радует насыщенным вкусом, сочной начинкой и ароматной сливочной шапочкой. Идеальный выбор для тех, кто ценит гармонию вкусов и теплоту запеченных блюд!",
        "category":  "Сеты",
        "ingredients":  [
                            "Запеченный с угрем",
                            "Запеченный дуэт",
                            "Запеченный с лососем"
                        ],
        "price":  1599,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c4f78904a20_w900.jpg"
    },
    {
        "id":  "toki-8851-8851-set-bomba",
        "name":  "Сет Бомба",
        "description":  "Сет \"Бомба\" — яркое сочетание вкусов, которое покорит каждого! В составе сета три популярных ролла: нежная \"Филадельфия\", изысканная \"Канада\" и оригинальный \"Эби ролл\". Это идеальный выбор для тех, кто хочет попробовать разнообразие вкусов и насладиться свежестью и качеством каждого ингредиента.",
        "category":  "Сеты",
        "ingredients":  [
                            "Филадельфия",
                            "Канада",
                            "Эби ролл"
                        ],
        "price":  2299,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c4d7c13639f_w900.jpg"
    },
    {
        "id":  "toki-8852-8852-set-hit",
        "name":  "Сет ХИТ",
        "description":  "Сет ХИТ – идеальное сочетание популярных роллов: нежная «Филадельфия Лайт» с лососем, яркая «Калифорния» с микс-крабом и освежающая «Канада Лайт» с нежным угрём. Лёгкие, сбалансированные вкусы для настоящих гурманов!",
        "category":  "Сеты",
        "ingredients":  [
                            "Калифорния",
                            "Филадельфия лайт",
                            "Канада лайт"
                        ],
        "price":  1599,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/6635fd8a2dbd0_w900.jpg"
    },
    {
        "id":  "toki-8853-8853-set-mnogo-lososya",
        "name":  "Сет Много Лосося",
        "description":  "Сет \"Много лосося\" — настоящий праздник для любителей этого нежного и сочного ингредиента. Включает в себя три вида роллов с лососем: классический, запеченный и в хрустящей темпуре. Идеальный выбор для тех, кто ценит насыщенный вкус и разнообразие текстур.",
        "category":  "Сеты",
        "ingredients":  [
                            "Филадельфия",
                            "Темпура с лососем",
                            "Запеченный с лососем"
                        ],
        "price":  1899,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/65bccb4994c5e_w900.jpg"
    },
    {
        "id":  "toki-8854-8854-set-dlya-bolshoi-kompanii",
        "name":  "Сет Для Большой Компании",
        "description":  "Сет \"Для Большой Компании\" – это идеальное решение для дружеских встреч, семейных праздников или корпоративных вечеров. В этом наборе мы собрали самые популярные и любимые вкусы, чтобы каждый нашел что-то по душе. Нежные классические маки, изысканные запеченные роллы и оригинальные сочетания с лососем и тунцом создают гармонию вкусов и текстур. Этот сет станет центром вашего стола, объединяя всех за одним вкусным моментом.",
        "category":  "Сеты",
        "ingredients":  [
                            "Маки с лососем",
                            "Маки с микс-крабом",
                            "Филадельфия Лайт",
                            "Калифорния с лососем",
                            "Дракон",
                            "Запеченый с лососем",
                            "Туна HOT"
                        ],
        "price":  2999,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c5e8c22e9b6_w900.jpg"
    },
    {
        "id":  "toki-8855-8855-set-kanada-miks",
        "name":  "Сет Канада Микс",
        "description":  "Сет «Канада МИКС» – изысканное сочетание вкусов для любителей угря. В составе: маки с нежным угрём, 2 суши с угрём, 2 гункана с угрём и фирменный ролл «Дракон». Идеальный выбор для ценителей японской кухни!",
        "category":  "Сеты",
        "ingredients":  [
                            "Маки с угрем",
                            "Суши с угрем х2",
                            "Гункан с угрем х2",
                            "Дракон"
                        ],
        "price":  1999,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c5e181d749b_w900.jpg"
    },
    {
        "id":  "toki-8856-8856-set-na-probu",
        "name":  "Сет На Пробу",
        "description":  "Сет \"На пробу\" – это идеальное сочетание классики и оригинальности, созданное для знакомства с нашими лучшими вкусами. Легкость и свежесть, нежные сливочные акценты, изысканные копченые нотки, хрустящая текстура и теплые соусные оттенки – все это вы найдете в одном наборе. Этот сет станет отличным выбором для тех, кто хочет попробовать сразу несколько вариаций роллов и насладиться разнообразием вкусов.",
        "category":  "Сеты",
        "ingredients":  [
                            "Маки с огурцом",
                            "Филадельфия лайт",
                            "Канада лайт",
                            "Эби темпура",
                            "Запеченная Калифорния"
                        ],
        "price":  2299,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c4f7a266e39_w900.jpg"
    },
    {
        "id":  "toki-8857-8857-set-filadelfiya-miks",
        "name":  "Сет Филадельфия Микс",
        "description":  "Сет «Филадельфия МИКС» — идеальный выбор для любителей лосося! В составе: классический ролл «Филадельфия» с нежным сливочным сыром и лососем, ролл «Сяке маки», 2 суши с лососем и 2 гункана с сочным лососем. Свежие ингредиенты и насыщенный вкус в каждом элементе сета!",
        "category":  "Сеты",
        "ingredients":  [
                            "Маки с лососем",
                            "Суши с лососем х2",
                            "Гункан с лососем х2",
                            "Филадельфия"
                        ],
        "price":  2099,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c5e36d74258_w900.jpg"
    },
    {
        "id":  "toki-8858-8858-set-zamurchatelnyi",
        "name":  "Сет заМУРчательный",
        "description":  "Сет \"ЗаМУРчательный\" – идеальное сочетание вкусов для настоящих гурманов! Включает в себя разнообразие роллов с нежным лососем, хрустящим огурцом и сливочным сыром. Прекрасный выбор для компании или семейного ужина.",
        "category":  "Сеты",
        "ingredients":  [
                            "Маки с лососем",
                            "Маки с огурцом",
                            "Лосось бонито",
                            "Калифорния с лососем",
                            "Филадельфия модерн"
                        ],
        "price":  2099,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c5e9b9c8d03_w900.jpg"
    },
    {
        "id":  "toki-8859-8859-set-toki",
        "name":  "Сет ТОКИ",
        "description":  "Флагманский сет \"Токи\" – это идеальное сочетание классики и оригинальности, созданное для настоящих ценителей японской кухни. В этом наборе гармонично сочетаются свежие, запеченные и хрустящие роллы, которые подарят вам разнообразие вкусов и текстур. Яркие ингредиенты, нежные начинки и сбалансированные сочетания делают этот сет универсальным выбором для любого случая – будь то уютный ужин, дружеская встреча или праздничное застолье. \"Токи\" – это гастрономическое путешествие, которое удивит и порадует каждого.",
        "category":  "Сеты",
        "ingredients":  [
                            "Филадельфия",
                            "Канада лайт",
                            "Калифорния",
                            "Запеченный дуэт",
                            "Изуми HOT",
                            "Темпура с курочкой",
                            "Темпура с лососем",
                            "Маки с огурцом"
                        ],
        "price":  3699,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66c4f7bb1a410_w900.jpg"
    },
    {
        "id":  "toki-8869-8869-set-baza",
        "name":  "Сет База",
        "description":  "Сет классических маки роллов:\r\nСяке маки\r\nУнаги маки\r\nКапа маки\r\nЭби маки",
        "category":  "Сеты",
        "ingredients":  [
                            "Сяке маки",
                            "Унаги маки",
                            "Капа маки",
                            "Эби маки"
                        ],
        "price":  1099,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/698313bcda5e6_w900.jpg"
    },
    {
        "id":  "toki-8870-8870-set-tempura",
        "name":  "Сет Темпура",
        "description":  "Сет «Темпура» — хрустящее наслаждение в каждом кусочке! В составе: темпура с угрем, темпура с лососем и темпура с креветкой. Нежная начинка, обжаренная в золотистой хрустящей кляре, подарит вам незабываемое сочетание текстур и вкусов. Идеальный выбор для ценителей японской кухни!",
        "category":  "Сеты",
        "ingredients":  [
                            "Эби темпура",
                            "Темпура с угрем",
                            "Темпура с лососем"
                        ],
        "price":  1599,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/6635fd6a5c993_w900.jpg"
    },
    {
        "id":  "toki-8872-8872-set-vse-vklucheno-m",
        "name":  "Сет ВСЁ ВКЛЮЧЕНО M",
        "description":  "Сет с разнообразными морепродуктами на 2-4 персоны.",
        "category":  "Сеты",
        "ingredients":  [
                            "Дуэт фьюжен",
                            "Калифорния фьюжен",
                            "Темпура с мидиями 1/2 ФИКС",
                            "Темпура с кальмаром 1/2 ФИКС",
                            "КотОпёс",
                            "Мусс с угрём ФИКС",
                            "Тайский лайт ФИКС"
                        ],
        "price":  2499,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/66e2fbe3ce22a_w900.jpg"
    },
    {
        "id":  "toki-8875-8875-set-vkusnyi",
        "name":  "Сет вКУСЬный",
        "description":  "Сет «ВКУСЬный» – гармоничное сочетание классических вкусов! В составе: нежный ролл «Филадельфия», освежающие «Капа маки» с огурцом и хрустящая темпура с лососем. Идеальный выбор для тех, кто хочет насладиться разнообразием японской кухни!",
        "category":  "Сеты",
        "ingredients":  [
                            "Ролл с огурцом",
                            "Филадельфия",
                            "Темпура с лососем"
                        ],
        "price":  1599,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/65bd401a45518_w900.jpg"
    },
    {
        "id":  "toki-9072-9072-set-vse-vklucheno-s",
        "name":  "Сет ВСЁ ВКЛЮЧЕНО S",
        "description":  "Сет с разнообразными морепродуктами на 1-3 персоны.",
        "category":  "Сеты",
        "ingredients":  [
                            "Темпура калифорния",
                            "Колючий ФЬЮЖЕН",
                            "Мусс с угрем",
                            "Котопес"
                        ],
        "price":  1999,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/676e8afded579_w900.jpg"
    },
    {
        "id":  "toki-9080-9080-set-vse-vklucheno-xl",
        "name":  "Сет ВСЁ ВКЛЮЧЕНО XL",
        "description":  "Сет с разнообразными морепродуктами на 4-8 персоны.",
        "category":  "Сеты",
        "ingredients":  [
                            "Темпура калифорния",
                            "Темпура с мидиями и кальмаром",
                            "Колючий ФЬЮЖЕН",
                            "Запеченный с угрем ФЬЮЖЕН",
                            "Криспи чикен",
                            "Мусс с угрем",
                            "Кальмар кунжут",
                            "КотоПес",
                            "Хрустящая темпура",
                            "Тайский мини"
                        ],
        "price":  3999,
        "emoji":  "🍱",
        "image":  "https://toki.su/__/images/menuProduct/6781577a092d9_w900.jpg"
    },
    {
        "id":  "toki-9288-9288-moti-vishnya-v-shokolade",
        "name":  "Моти Вишня в шоколаде",
        "description":  "Идеальный дуэт страсти и нежности. Сочный вишневый конфитюр, заключенный в бархатную основу из белого и темного шоколада с маскарпоне. Все это - в нежнейшем рисовом тесте. Классика, которая никогда не подводит.\r\nВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Вишня",
                            "Шоколад тёмный",
                            "Шоколад белый",
                            "Сливки",
                            "Сахарная пудра",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Сахар"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68c2b894c16ae_w900.jpg"
    },
    {
        "id":  "toki-9289-9289-moti-mango-marakuiya",
        "name":  "Моти Манго-Маракуйя Фреш",
        "description":  "Солнечный взрыв тропиков в каждом укусе! Сочный конфитюр из спелого манго, страсти маракуйи и свежести лайма. Основа из нежного белого шоколада, пюре манго и маскарпоне создает кремовую гармонию. Все упаковано в мягкое рисовое тесто. Ощутите отпуск на тропическом острове!\r\nВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Манго",
                            "Маракуйя",
                            "Лайм",
                            "Сахар",
                            "Шоколад белый",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Сливки",
                            "Сахарная пудра."
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68c2b8b07d131_w900.jpg"
    },
    {
        "id":  "toki-9290-9290-moti-bananovyi-brauni",
        "name":  "Моти Банановый Брауни",
        "description":  "Тот самый десерт, который сочетает нежность банана, шоколадную глубину брауни и легкость маскарпоне с белым шоколадом. Наслаждение без границ!\r\n ВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Шоколад тёмный",
                            "Сахар",
                            "Какао",
                            "Банан",
                            "Лимонный сок",
                            "Шоколад белый",
                            "Маскарпоне",
                            "Сыр твороный",
                            "Сливки."
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68c2abee06a47_w900.jpg"
    },
    {
        "id":  "toki-9291-9291-moti-malinovyi-praline",
        "name":  "Моти Малиновый Пралине",
        "description":  "Сочный малиновый конфитюр встречается с кремовой основой из маскарпоне, фисташковой пасты и белого шоколада. Все укутано в нежное рисовое тесто. Фисташка добавляет мягкий ореховый акцент, а малина - яркую кислинку.\r\nВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Малина",
                            "Сахар",
                            "Шоколад белый",
                            "Сливки",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Фисташковая паста",
                            "Сахарная пудра"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68c2b8d553529_w900.jpg"
    },
    {
        "id":  "toki-9292-9292-moti-mokachino-s",
        "name":  "Моти Мокачино с Зефирками",
        "description":  "Ваш уютный кофейный ритуал в формате МОти! Воздушное маршмелоу и шоколадно-кофейная гармония. Согреет и подарит наслаждение даже в пасмурный день.\r\nВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Шоколад тёмный",
                            "Шоколад белый",
                            "Сливки",
                            "Маскарпоне",
                            "Сыр Творожный",
                            "Сахарная пудра",
                            "Кофе растворимый",
                            "Мини маршмеллоу"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68c2b6f7185f2_w900.jpg"
    },
    {
        "id":  "toki-9293-9293-moti-tropicheskii-baunti",
        "name":  "Моти Тропический Баунти",
        "description":  "Райское наслаждение, которое перенесет вас на солнечный пляж! Сочный конфитюр из спелого манго и кремовая основа из белого шоколада, маскарпоне и кокосовой стружки. Насладитесь идеальным балансом тропической сладости и легкой свежести.\r\nВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Манго",
                            "Белый шоколад",
                            "Сливки",
                            "Сгущенное молоко",
                            "Сахарная пудра",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Сахар",
                            "Кокосовая стружка."
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68c92978d328a_w900.jpg"
    },
    {
        "id":  "toki-9294-9294-moti-klubnichnyi-mohito",
        "name":  "Моти Клубничный Мохито",
        "description":  "Описание на сайте отсутствует.",
        "category":  "Моти",
        "ingredients":  [

                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68d96f1568609_w900.jpg"
    },
    {
        "id":  "toki-9295-9295-moti-ferrero",
        "name":  "Моти Ферреро",
        "description":  "Описание на сайте отсутствует.",
        "category":  "Моти",
        "ingredients":  [

                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68d96f301d768_w900.jpg"
    },
    {
        "id":  "toki-9314-9314-moti-tiramisu",
        "name":  "Моти Тирамису",
        "description":  "Описание на сайте отсутствует.",
        "category":  "Моти",
        "ingredients":  [

                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/68d96f4d9a247_w900.jpg"
    },
    {
        "id":  "toki-9473-9473-moti-grusha-mindal-bri",
        "name":  "Моти Груша-Миндаль-Бри",
        "description":  "ВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Шоколад белый",
                            "СЛивки",
                            "Сыр бри",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Сахарная пудра",
                            "Миндаль",
                            "Груша",
                            "Лимонны сок"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/694e7010ed272_w900.jpg"
    },
    {
        "id":  "toki-9474-9474-moti-pop-korn",
        "name":  "Моти Поп-Корн",
        "description":  "ВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Белый шоколад",
                            "Сливки",
                            "Попкорн",
                            "Сироп",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Карамель",
                            "Сахарная пудра"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/694e710a58c4a_w900.jpg"
    },
    {
        "id":  "toki-9475-9475-moti-klubnichnoe-rafaello",
        "name":  "Моти Клубничное Рафаэлло",
        "description":  "ВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Белый шоколад",
                            "Сливки кокосовые",
                            "СЛивки",
                            "Паста кокосовая",
                            "СТружка кокосовая",
                            "Клубника",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Сахарная пудра"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/694e717a80750_w900.jpg"
    },
    {
        "id":  "toki-9476-9476-moti-karamelnyi-lotus",
        "name":  "Моти Карамельный Лотус-Клюква",
        "description":  "ВАЖНО: Продаются в замороженном виде!",
        "category":  "Моти",
        "ingredients":  [
                            "Клюква",
                            "Шоколад белый",
                            "Сливки",
                            "Паста Лотус",
                            "Печенье Лотус",
                            "Маскарпоне",
                            "Сыр творожный",
                            "Сахар",
                            "Лимонная кислота"
                        ],
        "price":  179,
        "emoji":  "🍡",
        "image":  "https://toki.su/__/images/menuProduct/694e71f3b6d28_w900.jpg"
    },
    {
        "id":  "toki-9408-9408-chai-chernyi-klubnika",
        "name":  "Чай Черный Клубника-Карамель",
        "description":  "Отборный черный чай с ароматом свежих ягод клубники и сладкой карамели.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Клубника",
                            "Карамель"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68b8802d7e128_w900.jpg"
    },
    {
        "id":  "toki-9416-9416-chai-chernyi-slivochnaya",
        "name":  "Чай Чёрный Сливочная Дыня",
        "description":  "Отборный черный чай с ярким ароматом и вкусом спелой дыни. Залейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая. Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Карамель",
                            "Дыня",
                            "Ананас",
                            "Персик",
                            "Лепестки календулы"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68b88108bfef6_w900.jpg"
    },
    {
        "id":  "toki-9417-9417-chai-zelenyi-bananovyi",
        "name":  "Чай Зеленый Банановый Улун",
        "description":  "Отборный зеленый чай с банановым ароматом.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Китайский улун",
                            "Банан"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf6c6b33825_w900.jpg"
    },
    {
        "id":  "toki-9418-9418-chai-zelenyi-molochnyi",
        "name":  "Чай Зеленый Молочный Улун",
        "description":  "Отборный Китайский улун с провинции Фуцзянь.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Китайский улун"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf6d1d6bd35_w900.jpg"
    },
    {
        "id":  "toki-9419-9419-chai-zelenyi-vishnya",
        "name":  "Чай Зеленый Вишня-Брусника",
        "description":  "Отборный зеленый чай с ароматом свежих ягод вишни и брусники.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай зеленый",
                            "Вишня",
                            "Брусника",
                            "Брусничный лист"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf6df270383_w900.jpg"
    },
    {
        "id":  "toki-9420-9420-chai-chernyi-malina",
        "name":  "Чай Черный Малина-Фиалка",
        "description":  "Отборный черный чай с ароматом малины, жасмина, ванили и розы.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Малина",
                            "Фиалка",
                            "Жасмин",
                            "Ваниль",
                            "Роза",
                            "Личи",
                            "Бузина"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf6e91cfae3_w900.jpg"
    },
    {
        "id":  "toki-9421-9421-chai-chernyi-apelsin",
        "name":  "Чай Черный Апельсин-Мята",
        "description":  "Отборный черный чай с ароматом спелого апельсина и освежающей мяты.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Цедра апельсина",
                            "Мята"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf6f341fc81_w900.jpg"
    },
    {
        "id":  "toki-9422-9422-chai-chernyi-pryanyi",
        "name":  "Чай Черный Пряный Апельсин",
        "description":  "Отборный черный чай с цитрусовым ароматом с пряным послевкусием специй и лайма.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Апельсин",
                            "Лайм",
                            "Розмарин",
                            "Розовый перец",
                            "Гвоздика",
                            "Кардамон",
                            "Лепестки подсолнечника"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf6fe575c2d_w900.jpg"
    },
    {
        "id":  "toki-9423-9423-chai-chernyi-vishnya-v",
        "name":  "Чай Черный Вишня в шоколаде",
        "description":  "Отборный черный чай с ароматом шоколадно-вишневого бисквита.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Лепестки розы",
                            "Какао-бобы",
                            "Вишня"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68bf7098986d1_w900.jpg"
    },
    {
        "id":  "toki-9424-9424-chai-chernyi-angliiskaya",
        "name":  "Чай Черный Английская королева",
        "description":  "Отборный черный чай, сочетание терпкости и нежности ягод.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Лепестки чайной розы",
                            "Клубника",
                            "Ежевика"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68c19183b0bc9_w900.jpg"
    },
    {
        "id":  "toki-9425-9425-chai-chernyi",
        "name":  "Чай Черный Императорский",
        "description":  "Отборный черный чай с поистине императорским ароматом.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Манго",
                            "Ежевика",
                            "Рябина",
                            "Барбарис",
                            "Брусника",
                            "Облепиха",
                            "Черная смородина",
                            "Клубника",
                            "Лепестки чайной розы"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68c1927d2be6d_w900.jpg"
    },
    {
        "id":  "toki-9426-9426-chai-chernyi-glintvein",
        "name":  "Чай Черный Глинтвейн",
        "description":  "Отборный черный чай с ароматом Альпийского глинтвейна.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай черный",
                            "Апельсин",
                            "Грейпфрут",
                            "Имбирь",
                            "Яблоко",
                            "Черная смородина",
                            "Ежевика",
                            "Рябина",
                            "Каркадэ",
                            "Корица",
                            "Гвоздика",
                            "Кардамон",
                            "Бадьян"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68c1934dc29ce_w900.jpg"
    },
    {
        "id":  "toki-9427-9427-chai-zelenyi-persik",
        "name":  "Чай Зеленый Персик-Абрикос",
        "description":  "Отборный черный чай с мягким вкусом и ароматом спелых фруктов.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Чай зеленый",
                            "Персик",
                            "Абрикос",
                            "Апельсин",
                            "Лепестки чайной розы"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68c194017b18e_w900.jpg"
    },
    {
        "id":  "toki-9442-9442-chai-zelenyi-ananasovyi",
        "name":  "Чай Зеленый Ананасовый Улун",
        "description":  "Отборный зеленый чай с ананасовым ароматом.\r\nЗалейте кипяток в стакан и насладитесь незабываемым вкусом и ароматом авторского чая.\r\nВажно: Важно: доставляется в одноразовом стакане с крышкой без воды.",
        "category":  "Авторский чай",
        "ingredients":  [
                            "Китайский улун",
                            "Ананас"
                        ],
        "price":  50,
        "emoji":  "🍵",
        "image":  "https://toki.su/__/images/menuProduct/68c7079df0205_w900.jpg"
    },
    {
        "id":  "toki-8862-8862-soevyi-sous",
        "name":  "Соевый соус",
        "description":  "Соевый соус.",
        "category":  "Соуса",
        "ingredients":  [
                            "Соевый соус."
                        ],
        "price":  30,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/6567050b1f3fa_w900.jpg"
    },
    {
        "id":  "toki-8863-8863-imbir-marinovannyi",
        "name":  "Имбирь маринованный",
        "description":  "Имбирь маринованный белый.",
        "category":  "Соуса",
        "ingredients":  [
                            "Имбирь маринованный белый."
                        ],
        "price":  30,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/6567053038d68_w900.jpg"
    },
    {
        "id":  "toki-8864-8864-vasabi",
        "name":  "Васаби",
        "description":  "Васаби.",
        "category":  "Соуса",
        "ingredients":  [
                            "Васаби."
                        ],
        "price":  30,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/65670546b02b8_w900.jpg"
    },
    {
        "id":  "toki-8865-8865-sous-orehovyi",
        "name":  "Соус Ореховый",
        "description":  "Соус Ореховый",
        "category":  "Соуса",
        "ingredients":  [
                            "Соус Ореховый. Производитель компания Тамаки."
                        ],
        "price":  50,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/65670560b9d40_w900.jpg"
    },
    {
        "id":  "toki-8866-8866-sous-spaisi",
        "name":  "Соус Спайси",
        "description":  "Спайси соус",
        "category":  "Соуса",
        "ingredients":  [
                            "Майонез",
                            "Соус \"шри-рача\"",
                            "Икра масаго"
                        ],
        "price":  50,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/656705b0c0d24_w900.jpg"
    },
    {
        "id":  "toki-8867-8867-sous-mango-marakuiya",
        "name":  "Соус Манго-маракуйя",
        "description":  "Манго-маракуйя соус",
        "category":  "Соуса",
        "ingredients":  [
                            "Сироп/пюре манго",
                            "Сироп/пюре маракуйя",
                            "Майонез",
                            "Соус \"шри-рача\"",
                            "Соус \"унаги\"",
                            "Краситель пищевой."
                        ],
        "price":  50,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/656705cc1392d_w900.jpg"
    },
    {
        "id":  "toki-8930-8930-unagi-sous",
        "name":  "Унаги-соус",
        "description":  "Унаги-соус",
        "category":  "Соуса",
        "ingredients":  [
                            "Унаги-соус. Производитель компания Тамаки."
                        ],
        "price":  50,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/6622d93ae57b2_w900.jpg"
    },
    {
        "id":  "toki-8953-8953-sous-slivochnyi-vasabi",
        "name":  "Соус Сливочный Васаби",
        "description":  "Состав: Васаби парашек, Сгущенное молоко, Майонез, Краситель пищевой",
        "category":  "Соуса",
        "ingredients":  [
                            "Васаби парашек",
                            "Сгущенное молоко",
                            "Майонез",
                            "Краситель пищевой"
                        ],
        "price":  50,
        "emoji":  "🥫",
        "image":  "https://toki.su/__/images/menuProduct/66570c9720fe0_w900.jpg"
    },
    {
        "id":  "toki-8905-8905-losos-dlya-kotika",
        "name":  "Лосось для котика",
        "description":  "Все средства, с продажи лакомства, мы направляем в приют на помощь беспризорным животным.\r\n\r\nНежный охлажденный лосось, чтобы порадовать Вашего питомца.",
        "category":  "Для котика",
        "ingredients":  [
                            "Лосось охлажденный"
                        ],
        "price":  100,
        "emoji":  "🐱",
        "image":  "https://toki.su/__/images/menuProduct/67d7f0f02f7aa_w900.jpg"
    },
    {
        "id":  "toki-8906-8906-govyaje-legkoe-dlya",
        "name":  "Говяжье легкое для пёсика",
        "description":  "Все средства, с продажи лакомства, мы направляем в приют на помощь беспризорным животным.\r\n\r\nСушеное легкое - это особое лакомство, которое понравится каждой собаке.",
        "category":  "Для котика",
        "ingredients":  [
                            "Сушеное говяжье легкое"
                        ],
        "price":  100,
        "emoji":  "🐱",
        "image":  "https://toki.su/__/images/menuProduct/67e0675891650_w900.jpg"
    },
    {
        "id":  "toki-8868-8868-palochki-dlya-sushi",
        "name":  "Палочки для суши",
        "description":  "Палочки для суши.",
        "category":  "Приборы",
        "ingredients":  [
                            "Палочки для суши."
                        ],
        "price":  10,
        "emoji":  "🥢",
        "image":  "https://toki.su/__/images/menuProduct/656705e243ec4_w900.jpg"
    },
    {
        "id":  "toki-8903-8903-vilka",
        "name":  "Вилка.",
        "description":  "Вилка пластиковая.",
        "category":  "Приборы",
        "ingredients":  [
                            "Вилка пластиковая."
                        ],
        "price":  15,
        "emoji":  "🥢",
        "image":  "https://toki.su/__/images/menuProduct/65facaac94e87_w900.jpg"
    },
    {
        "id":  "toki-8904-8904-perchatki",
        "name":  "Перчатки.",
        "description":  "Перчатки нитриловые черные.",
        "category":  "Приборы",
        "ingredients":  [
                            "Перчатки нитриловые черные."
                        ],
        "price":  15,
        "emoji":  "🥢",
        "image":  "https://toki.su/__/images/menuProduct/65facc1bf1d03_w900.jpg"
    },
    {
        "id":  "toki-9396-9396-komplekt-soevyi-sous",
        "name":  "Комплект: соевый соус, имбирь,васаби, палочки",
        "description":  "Описание на сайте отсутствует.",
        "category":  "Приборы",
        "ingredients":  [

                        ],
        "price":  99,
        "emoji":  "🥢",
        "image":  ""
    }
];

const nutritionByProductId = {"8869":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"32 шт. ± 460 г."},"8957":{"calories":773.5,"proteins":31.5,"fats":31.5,"carbohydrates":45.5,"weight":"8 шт. ± 350 г."},"9408":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8870":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"24 шт. ± 880 г."},"9488":{"calories":724.5,"proteins":31.5,"fats":28,"carbohydrates":35,"weight":"8 шт. ± 350 г."},"8817":{"calories":432.4,"proteins":18.4,"fats":11.5,"carbohydrates":29.9,"weight":"8 шт. ± 230 г."},"8888":{"calories":584.2,"proteins":23,"fats":18.4,"carbohydrates":29.9,"weight":"8 шт. ± 230 г."},"8783":{"calories":741,"proteins":18,"fats":24,"carbohydrates":75,"weight":"8 шт. ± 280 г."},"9413":{"calories":1033.2,"proteins":30.8,"fats":67.2,"carbohydrates":36.4,"weight":"8 шт. ± 280 г."},"9056":{"calories":517.5,"proteins":20.7,"fats":23,"carbohydrates":27.6,"weight":"8 шт. ± 240 г."},"9347":{"calories":483.3,"proteins":27,"fats":18.9,"carbohydrates":35.1,"weight":"8 шт. ± 270 г."},"8855":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"20 шт. ± 570 г."},"8929":{"calories":748.2,"proteins":31.9,"fats":37.7,"carbohydrates":34.8,"weight":"8 шт. ± 280 г."},"9473":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"9086":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 250 г."},"9352":{"calories":921.2,"proteins":16.8,"fats":64.4,"carbohydrates":null,"weight":"8 шт. ± 280 г."},"8908":{"calories":267.3,"proteins":5.5,"fats":5.5,"carbohydrates":22,"weight":"8 шт. ± 110 г."},"9410":{"calories":915.6,"proteins":19.6,"fats":30.8,"carbohydrates":70,"weight":"8 шт. ± 280 г."},"8799":{"calories":728,"proteins":16.8,"fats":39.2,"carbohydrates":36.4,"weight":"8 шт. ± 280 г."},"9288":{"calories":113.5,"proteins":1.2,"fats":2,"carbohydrates":23.3,"weight":"1 шт. ± 50 г."},"8826":{"calories":466.9,"proteins":18.4,"fats":16.1,"carbohydrates":25.3,"weight":"8 шт. ± 240 г."},"9048":{"calories":631.8,"proteins":23.4,"fats":28.6,"carbohydrates":36.4,"weight":"8 шт. ± 270 г."},"8872":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"48 шт. ± 1470 г."},"8829":{"calories":530.4,"proteins":19.2,"fats":19.2,"carbohydrates":36,"weight":"8 шт. ± 240 г."},"8863":{"calories":4.5,"proteins":0,"fats":0,"carbohydrates":0.9,"weight":"20 гр."},"9396":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 комплект"},"9416":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8802":{"calories":571.3,"proteins":26.1,"fats":20.3,"carbohydrates":34.8,"weight":"8 шт. ± 280 г."},"8831":{"calories":480.6,"proteins":10.8,"fats":23.4,"carbohydrates":25.2,"weight":"8 шт. ± 200 г."},"8859":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"64 шт. ± 1980 г."},"8791":{"calories":774,"proteins":18,"fats":30,"carbohydrates":66,"weight":"8 шт. ± 280 г."},"8931":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 140 г."},"9412":{"calories":1069.6,"proteins":33.6,"fats":61.6,"carbohydrates":36.4,"weight":"8 шт. ± 280 г."},"8864":{"calories":37.6,"proteins":1.5,"fats":0.9,"carbohydrates":5.7,"weight":"10 гр."},"8945":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 140 г."},"8953":{"calories":149.7,"proteins":1.2,"fats":12.3,"carbohydrates":5.7,"weight":"30 г."},"8835":{"calories":633.6,"proteins":26.4,"fats":26.4,"carbohydrates":33.6,"weight":"8 шт. ± 240 г."},"8816":{"calories":420.9,"proteins":16.1,"fats":9.2,"carbohydrates":29.9,"weight":"8 шт. ± 230 г."},"8833":{"calories":604.8,"proteins":24.3,"fats":27,"carbohydrates":32.4,"weight":"8 шт. ± 270 г."},"9289":{"calories":113.5,"proteins":1.2,"fats":2,"carbohydrates":23,"weight":"1 шт. ± 50 г."},"9055":{"calories":831.6,"proteins":30.8,"fats":44.8,"carbohydrates":39.2,"weight":"8 шт ± 280 г."},"9034":{"calories":464.4,"proteins":12.6,"fats":16.2,"carbohydrates":28.8,"weight":"8 шт. ± 180 г."},"8797":{"calories":686.4,"proteins":12,"fats":40.8,"carbohydrates":28.8,"weight":"8 шт. ± 270 г."},"8883":{"calories":735,"proteins":21,"fats":30,"carbohydrates":66,"weight":"8 шт. ± 280 г."},"8851":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"24 шт. ± 810 г."},"9424":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8853":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"24 шт. ± 850 г."},"9487":{"calories":506,"proteins":14,"fats":22,"carbohydrates":28,"weight":"8 шт. ± 200 г."},"9421":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8830":{"calories":591.3,"proteins":18.9,"fats":24.3,"carbohydrates":37.8,"weight":"8 шт. ± 270 г."},"8881":{"calories":705,"proteins":21,"fats":18,"carbohydrates":75,"weight":"8 шт. ± 280 г."},"8874":{"calories":684,"proteins":14.4,"fats":40.8,"carbohydrates":28.8,"weight":"8 шт. ± 270 г."},"8958":{"calories":500.4,"proteins":16.2,"fats":23.4,"carbohydrates":25.2,"weight":"8 шт. ± 180 г."},"8875":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"24 шт. ± 640 г."},"9085":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 250 г."},"8801":{"calories":803.6,"proteins":22.4,"fats":47.6,"carbohydrates":33.6,"weight":"8 шт. ± 280 г."},"9291":{"calories":92.5,"proteins":1.2,"fats":3.8,"carbohydrates":14,"weight":"1 шт. ± 50 г."},"8901":{"calories":804,"proteins":21,"fats":48,"carbohydrates":72,"weight":"± 300 г."},"8858":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"40 шт. ± 910 г."},"8792":{"calories":704,"proteins":22.4,"fats":16,"carbohydrates":80,"weight":"8 шт. ± 300 г."},"8844":{"calories":600,"proteins":12.5,"fats":25,"carbohydrates":35,"weight":"8 шт. ± 240 г."},"9479":{"calories":516,"proteins":16.8,"fats":19.2,"carbohydrates":28.8,"weight":"8 шт. ± 240 г."},"9041":{"calories":701.4,"proteins":16.8,"fats":42,"carbohydrates":31.5,"weight":"8 шт. ± 210 г."},"9422":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"9426":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"9442":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция."},"8832":{"calories":540,"proteins":24.3,"fats":18.9,"carbohydrates":32.4,"weight":"8 шт. ± 280 г."},"8785":{"calories":235.4,"proteins":9.9,"fats":1.1,"carbohydrates":18.7,"weight":"8 шт. ± 110 г."},"8926":{"calories":778.4,"proteins":19.6,"fats":28,"carbohydrates":72.8,"weight":"± 280 г."},"9411":{"calories":873.6,"proteins":16.8,"fats":53.2,"carbohydrates":null,"weight":"8 шт. ± 280 г."},"9477":{"calories":468,"proteins":14.4,"fats":12,"carbohydrates":36,"weight":"8 шт. ± 240 г."},"8903":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт."},"9418":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"9089":{"calories":1041,"proteins":24,"fats":69,"carbohydrates":42,"weight":"8 шт. ± 280 г."},"9350":{"calories":595.2,"proteins":14.4,"fats":28.8,"carbohydrates":33.6,"weight":"8 шт. ± 240 г."},"9092":{"calories":932.4,"proteins":25.2,"fats":61.6,"carbohydrates":39.2,"weight":"8 шт. ± 280 г."},"8884":{"calories":684,"proteins":21,"fats":18,"carbohydrates":75,"weight":"8 шт. ± 280 г."},"8878":{"calories":805,"proteins":27.5,"fats":42.5,"carbohydrates":37.5,"weight":"8 шт. ± 250 г."},"8787":{"calories":205.7,"proteins":3.3,"fats":1.1,"carbohydrates":19.8,"weight":"8 шт. ± 110 г."},"8842":{"calories":642.5,"proteins":15,"fats":30,"carbohydrates":37.5,"weight":"8 шт. ± 240 г."},"8846":{"calories":548.6,"proteins":20.8,"fats":15.6,"carbohydrates":41.6,"weight":"8 шт. ± 230 г."},"9419":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"9427":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"9292":{"calories":122.5,"proteins":2.2,"fats":5,"carbohydrates":21.7,"weight":"1 шт. ± 50 г."},"8906":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 порция."},"9476":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"9475":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"8927":{"calories":856.8,"proteins":28,"fats":53.2,"carbohydrates":33.6,"weight":"8 шт. ± 270 г."},"8818":{"calories":666.9,"proteins":16.2,"fats":43.2,"carbohydrates":37.8,"weight":"8 шт. ± 280 г."},"8828":{"calories":591.3,"proteins":18.9,"fats":24.3,"carbohydrates":37.8,"weight":"8 шт. ± 270 г."},"8798":{"calories":796.5,"proteins":21.6,"fats":45.9,"carbohydrates":37.8,"weight":"8 шт. ± 280 г."},"9061":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"± 260 г."},"9474":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"9014":{"calories":697.5,"proteins":12.5,"fats":45,"carbohydrates":30,"weight":"8 шт. ± 250 г."},"9082":{"calories":841.5,"proteins":19.8,"fats":29.7,"carbohydrates":72.6,"weight":"8 шт. ± 330 г."},"8904":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 пара."},"8822":{"calories":565.6,"proteins":25.2,"fats":19.6,"carbohydrates":33.6,"weight":"8 шт. ± 280 г."},"8910":{"calories":575,"proteins":22.5,"fats":25,"carbohydrates":27.5,"weight":"8 шт. ± 250 г."},"8795":{"calories":844.8,"proteins":23.1,"fats":33,"carbohydrates":75.9,"weight":"8 шт. ± 320 г."},"8838":{"calories":562.8,"proteins":18.9,"fats":21,"carbohydrates":29.4,"weight":"8 шт. ± 210 г."},"8857":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"20 шт. ± 540 г."},"9080":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"80 шт. ± 2360 г."},"8930":{"calories":47.1,"proteins":0.9,"fats":0,"carbohydrates":10.8,"weight":"30 гр."},"8946":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 140 г."},"8852":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"24 шт. ± 700 г."},"9091":{"calories":1008,"proteins":19.6,"fats":70,"carbohydrates":39.2,"weight":"8 шт. ± 280 г."},"8868":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 пара."},"8885":{"calories":595.4,"proteins":20.8,"fats":26,"carbohydrates":31.2,"weight":"8 шт. ± 240 г."},"8786":{"calories":304.8,"proteins":8.4,"fats":7.2,"carbohydrates":24,"weight":"8 шт. ± 120 г."},"9294":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"8821":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 280 г."},"8923":{"calories":681,"proteins":15,"fats":15,"carbohydrates":81,"weight":"8 шт. ± 280 г."},"8824":{"calories":672.8,"proteins":26.1,"fats":31.9,"carbohydrates":29,"weight":"8 шт. ± 290 г."},"8867":{"calories":204.3,"proteins":0.3,"fats":15.6,"carbohydrates":4.5,"weight":"30 гр."},"8843":{"calories":645,"proteins":15,"fats":30,"carbohydrates":35,"weight":"8 шт. ± 240 г."},"8866":{"calories":176.1,"proteins":0.6,"fats":18.6,"carbohydrates":1.2,"weight":"30 гр."},"9072":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"32 шт. ± 1010 г."},"8820":{"calories":537.3,"proteins":24.3,"fats":21.6,"carbohydrates":27,"weight":"8 шт. ± 280 г."},"8862":{"calories":23.2,"proteins":1.6,"fats":0,"carbohydrates":4.4,"weight":"30 гр."},"9293":{"calories":305,"proteins":2,"fats":5,"carbohydrates":45,"weight":"1 шт. ± 50 г."},"8845":{"calories":624,"proteins":20.8,"fats":28.6,"carbohydrates":28.6,"weight":"8 шт. ± 260 г."},"8986":{"calories":606.6,"proteins":12.6,"fats":30.6,"carbohydrates":28.8,"weight":"8 шт. ± 180 г."},"8793":{"calories":693,"proteins":18,"fats":18,"carbohydrates":75,"weight":"8 шт. ± 280 г."},"8879":{"calories":625,"proteins":20,"fats":32.5,"carbohydrates":30,"weight":"8 шт. ± 270 г."},"9314":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"9417":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8905":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 порция."},"9451":{"calories":591.3,"proteins":18.9,"fats":24.3,"carbohydrates":37.8,"weight":"8 шт. ± 270 г."},"9423":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 порция"},"8916":{"calories":605.8,"proteins":23.4,"fats":26,"carbohydrates":33.8,"weight":"8 шт. ± 250 г."},"9425":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8856":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"40 шт. ± 1140 г."},"9054":{"calories":666.4,"proteins":16.8,"fats":42,"carbohydrates":39.2,"weight":"8 шт ± 280 г."},"8865":{"calories":126,"proteins":0.6,"fats":12,"carbohydrates":4.2,"weight":"30 гр."},"9409":{"calories":663.6,"proteins":30.8,"fats":11.2,"carbohydrates":72.8,"weight":"8 шт. ± 280 г."},"8971":{"calories":666.9,"proteins":29.7,"fats":24.3,"carbohydrates":45.9,"weight":"8 шт. ± 270 г."},"9353":{"calories":1019.2,"proteins":25.2,"fats":67.2,"carbohydrates":null,"weight":"8 шт. ± 280 г."},"8839":{"calories":585.6,"proteins":19.2,"fats":28.8,"carbohydrates":28.8,"weight":"8 шт. ± 240 г."},"9295":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"1 шт. ± 50 г."},"8895":{"calories":583.2,"proteins":29.7,"fats":18.9,"carbohydrates":37.8,"weight":"8 шт. ± 270 г."},"8782":{"calories":761.6,"proteins":16.8,"fats":30.8,"carbohydrates":67.2,"weight":"8 шт. ± 280 г."},"8825":{"calories":645.3,"proteins":18.9,"fats":32.4,"carbohydrates":29.7,"weight":"8 шт. ± 270 г."},"8854":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"56 шт. ± 1470 г."},"9290":{"calories":124.4,"proteins":2.4,"fats":6.6,"carbohydrates":14.4,"weight":"1 шт. ± 50 г."},"8790":{"calories":691.6,"proteins":22.4,"fats":19.6,"carbohydrates":70,"weight":"8 шт. ± 280 г."},"8928":{"calories":748.8,"proteins":26,"fats":44.2,"carbohydrates":28.6,"weight":"8 шт. ± 280 г."},"9415":{"calories":705.6,"proteins":28,"fats":33.6,"carbohydrates":33.6,"weight":"8 шт. ± 280 г."},"9414":{"calories":607.6,"proteins":39.2,"fats":19.6,"carbohydrates":28,"weight":"8 шт. ± 280 г."},"8850":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"24 шт. ± 810 г."},"9420":{"calories":0,"proteins":0,"fats":0,"carbohydrates":0,"weight":"1 порция"},"8800":{"calories":728,"proteins":19.6,"fats":42,"carbohydrates":33.6,"weight":"8 шт. ± 280 г."},"8972":{"calories":596.7,"proteins":24.3,"fats":27,"carbohydrates":32.4,"weight":"8 шт. ± 280 г."},"8880":{"calories":660,"proteins":24,"fats":12,"carbohydrates":75,"weight":"8 шт. ± 280 г."},"8803":{"calories":849.6,"proteins":16.8,"fats":55.2,"carbohydrates":36,"weight":"8 шт. ± 280 г."},"8836":{"calories":410,"proteins":20,"fats":8,"carbohydrates":28,"weight":"8 шт. ± 200 г."},"8827":{"calories":540,"proteins":19.2,"fats":19.2,"carbohydrates":36,"weight":"8 шт. ± 240 г."},"8919":{"calories":null,"proteins":null,"fats":null,"carbohydrates":null,"weight":"8 шт. ± 200 г."},"8788":{"calories":284.4,"proteins":8.4,"fats":7.2,"carbohydrates":19.2,"weight":"8 шт. ± 120 г."}};

const cart = new Map();
let activeCategory = "Все";
let searchQuery = "";
let activeProductId = null;

const menuNode = document.getElementById("menu");
const cartNode = document.getElementById("cart");
const cartTotalNode = document.getElementById("cart-total");
const checkoutButton = document.getElementById("checkout");
const searchInput = document.getElementById("search");
const categoryList = document.getElementById("category-list");

const menuTemplate = document.getElementById("menu-item-template");
const cartTemplate = document.getElementById("cart-item-template");
const cartPageTemplate = document.getElementById("cart-page-item-template");
const cartFab = document.getElementById("cart-fab");
const cartBadge = document.getElementById("cart-badge");
const cartPage = document.getElementById("cart-page");
const cartPageBackdrop = document.getElementById("cart-page-backdrop");
const cartPageClose = document.getElementById("cart-page-close");
const cartPageList = document.getElementById("cart-page-list");
const cartPageTotal = document.getElementById("cart-page-total");
const cartPageCheckout = document.getElementById("cart-page-checkout");
const checkoutPage = document.getElementById("checkout-page");
const checkoutPageBackdrop = document.getElementById("checkout-page-backdrop");
const checkoutPageClose = document.getElementById("checkout-page-close");
const checkoutPageList = document.getElementById("checkout-page-list");
const checkoutPageTotal = document.getElementById("checkout-page-total");
const checkoutPageSubmit = document.getElementById("checkout-page-submit");

const productModal = document.getElementById("product-modal");
const productModalBackdrop = document.getElementById("product-modal-backdrop");
const productModalClose = document.getElementById("product-modal-close");
const productModalImage = document.getElementById("product-modal-image");
const productModalEmoji = document.getElementById("product-modal-emoji");
const productModalTitle = document.getElementById("product-modal-title");
const productModalPrice = document.getElementById("product-modal-price");
const productModalDescription = document.getElementById("product-modal-description");
const productModalWeight = document.getElementById("product-modal-weight");
const productModalKcal = document.getElementById("product-modal-kcal");
const productModalProtein = document.getElementById("product-modal-protein");
const productModalFat = document.getElementById("product-modal-fat");
const productModalCarbs = document.getElementById("product-modal-carbs");
const productModalAdd = document.getElementById("product-modal-add");
const productModalQuantity = document.getElementById("product-modal-quantity");
const productModalDecrease = document.getElementById("product-modal-decrease");
const productModalIncrease = document.getElementById("product-modal-increase");
const productModalCount = document.getElementById("product-modal-count");

const formatPrice = (value) => `${value} ₽`;

const getItemById = (id) => menuItems.find((menuItem) => menuItem.id === id);
const slugifyCategory = (value) =>
  value
    .toLowerCase()
    .replace(/[^a-zа-я0-9]+/gi, "-")
    .replace(/^-+|-+$/g, "");
const getCategorySectionId = (category) => `category-${slugifyCategory(category)}`;

const parseSourceProductId = (menuItemId) => {
  const match = /^toki-(\d+)-/.exec(menuItemId);
  return match ? match[1] : "";
};

const formatNutrition = (value) => {
  if (typeof value !== "number" || Number.isNaN(value)) return "—";
  const rounded = Math.round(value * 10) / 10;
  return Number.isInteger(rounded) ? String(rounded) : rounded.toFixed(1);
};

const getNutrition = (item) => {
  const sourceId = parseSourceProductId(item.id);
  const nutrition = sourceId ? nutritionByProductId[sourceId] : null;
  if (!nutrition) {
    return {
      calories: "—",
      proteins: "—",
      fats: "—",
      carbohydrates: "—",
      weight: "",
    };
  }

  return {
    calories: formatNutrition(nutrition.calories),
    proteins: formatNutrition(nutrition.proteins),
    fats: formatNutrition(nutrition.fats),
    carbohydrates: formatNutrition(nutrition.carbohydrates),
    weight: nutrition.weight || "",
  };
};

const pulseCard = (id) => {
  const card = document.querySelector(`[data-item-id="${id}"]`);
  if (!card) return;
  card.classList.remove("is-added");
  void card.offsetWidth;
  card.classList.add("is-added");
  card.addEventListener(
    "animationend",
    () => {
      card.classList.remove("is-added");
    },
    { once: true }
  );
};

const getCategories = () => {
  const categories = new Set(menuItems.map((item) => item.category));
  return ["Все", ...categories];
};

const renderCategories = () => {
  categoryList.innerHTML = "";
  getCategories().forEach((category) => {
    const button = document.createElement("button");
    button.type = "button";
    button.className = `category-chip${category === activeCategory ? " is-active" : ""}`;
    button.textContent = category;
    button.addEventListener("click", () => {
      activeCategory = category;
      renderCategories();
      if (category === "Все") {
        menuNode.scrollIntoView({ behavior: "smooth", block: "start" });
        return;
      }
      const target = document.getElementById(getCategorySectionId(category));
      if (target) {
        target.scrollIntoView({ behavior: "smooth", block: "start" });
      }
    });
    categoryList.appendChild(button);
  });
};

const matchesSearch = (item) => {
  if (!searchQuery) return true;
  const query = searchQuery.toLowerCase();
  const haystack = [item.name, item.description, item.ingredients.join(" ")].join(" ").toLowerCase();
  return haystack.includes(query);
};

const filteredMenuItems = () =>
  menuItems.filter((item) => matchesSearch(item));

const groupMenuItems = (items) => {
  const groups = new Map();
  items.forEach((item) => {
    if (!groups.has(item.category)) {
      groups.set(item.category, []);
    }
    groups.get(item.category).push(item);
  });

  const ordered = getCategories().filter((category) => category !== "Все");
  return ordered
    .map((category) => ({
      category,
      items: groups.get(category) || [],
    }))
    .filter((group) => group.items.length > 0);
};

const openProductModal = (id) => {
  const item = getItemById(id);
  if (!item || !productModal) return;

  activeProductId = id;
  const nutrition = getNutrition(item);

  productModalTitle.textContent = item.name;
  productModalPrice.textContent = formatPrice(item.price);
  productModalDescription.textContent = item.description;
  productModalKcal.textContent = nutrition.calories;
  productModalProtein.textContent = nutrition.proteins;
  productModalFat.textContent = nutrition.fats;
  productModalCarbs.textContent = nutrition.carbohydrates;
  productModalWeight.textContent = nutrition.weight ? `Вес: ${nutrition.weight}` : "";

  if (item.image) {
    productModalImage.src = item.image;
    productModalImage.alt = item.name;
    productModalImage.hidden = false;
    productModalEmoji.hidden = true;
  } else {
    productModalImage.hidden = true;
    productModalEmoji.hidden = false;
    productModalEmoji.textContent = item.emoji || "🍣";
  }

  updateProductModalState();
  productModal.classList.add("is-open");
  productModal.setAttribute("aria-hidden", "false");
};

const closeProductModal = () => {
  if (!productModal) return;
  productModal.classList.remove("is-open");
  productModal.setAttribute("aria-hidden", "true");
  activeProductId = null;
};

const updateProductModalState = () => {
  if (!activeProductId || !productModalAdd || !productModalQuantity || !productModalCount) return;
  const count = cart.get(activeProductId) ?? 0;
  if (count > 0) {
    productModalAdd.hidden = true;
    productModalQuantity.hidden = false;
    productModalCount.textContent = count;
  } else {
    productModalAdd.hidden = false;
    productModalQuantity.hidden = true;
    productModalCount.textContent = "0";
  }
};

const createMenuCard = (item) => {
  const card = menuTemplate.content.cloneNode(true);
  const article = card.querySelector(".menu-card");
  article.dataset.itemId = item.id;

  const emojiNode = card.querySelector(".emoji");
  const imgNode = card.querySelector(".menu-card__photo");
  if (item.image) {
    imgNode.src = item.image;
    imgNode.alt = item.name;
    imgNode.hidden = false;
    emojiNode.hidden = true;
  } else {
    imgNode.hidden = true;
    emojiNode.hidden = false;
    emojiNode.textContent = item.emoji;
  }

  card.querySelector("h3").textContent = item.name;
  card.querySelector(".price").textContent = formatPrice(item.price);

  article.addEventListener("click", () => openProductModal(item.id));
  article.addEventListener("keydown", (event) => {
    if (event.key === "Enter" || event.key === " ") {
      event.preventDefault();
      openProductModal(item.id);
    }
  });

  return article;
};

const renderMenu = () => {
  menuNode.innerHTML = "";
  const items = filteredMenuItems();
  if (items.length === 0) {
    const empty = document.createElement("div");
    empty.className = "cart__empty";
    empty.textContent = "Ничего не найдено. Попробуйте изменить запрос.";
    menuNode.appendChild(empty);
    return;
  }

  const groupedItems = groupMenuItems(items);

  groupedItems.forEach((group) => {
    const section = document.createElement("section");
    section.className = "menu-category";
    section.id = getCategorySectionId(group.category);

    const header = document.createElement("header");
    header.className = "menu-category__header";

    const title = document.createElement("h3");
    title.className = "menu-category__title";
    title.textContent = group.category;
    header.appendChild(title);

    const rail = document.createElement("div");
    rail.className = "menu-rail";

    group.items.forEach((item) => {
      rail.appendChild(createMenuCard(item));
    });

    section.appendChild(header);
    section.appendChild(rail);
    menuNode.appendChild(section);
  });
};

const addToCart = (id) => {
  const currentCount = cart.get(id) ?? 0;
  cart.set(id, currentCount + 1);
  renderCartViews();
  updateProductModalState();
  pulseCard(id);
};

const updateCount = (id, delta) => {
  const currentCount = cart.get(id) ?? 0;
  const nextCount = currentCount + delta;
  if (nextCount <= 0) {
    cart.delete(id);
  } else {
    cart.set(id, nextCount);
  }
  renderCartViews();
  updateProductModalState();
  if (delta !== 0) pulseCard(id);
};

const renderCartMain = () => {
  cartNode.innerHTML = "";
  if (cart.size === 0) {
    const empty = document.createElement("div");
    empty.className = "cart__empty";
    empty.textContent = "Корзина пока пуста.";
    cartNode.appendChild(empty);
  } else {
    Array.from(cart.entries()).forEach(([id, count]) => {
      const item = getItemById(id);
      if (!item) return;
      const row = cartTemplate.content.cloneNode(true);
      row.querySelector(".name").textContent = item.name;
      row.querySelector(".details").textContent = `${formatPrice(item.price)} · ${count} шт`;
      row.querySelector(".count").textContent = count;
      row.querySelector(".decrease").addEventListener("click", () => updateCount(id, -1));
      row.querySelector(".increase").addEventListener("click", () => updateCount(id, 1));
      cartNode.appendChild(row);
    });
  }
};

const renderCartPage = () => {
  cartPageList.innerHTML = "";
  if (cart.size === 0) {
    const empty = document.createElement("div");
    empty.className = "cart__empty";
    empty.textContent = "Корзина пока пуста.";
    cartPageList.appendChild(empty);
    cartPageTotal.textContent = formatPrice(0);
    return;
  }
  Array.from(cart.entries()).forEach(([id, count]) => {
    const item = getItemById(id);
    if (!item) return;
    const row = cartPageTemplate.content.cloneNode(true);
    row.querySelector(".name").textContent = item.name;
    row.querySelector(".details").textContent = `${formatPrice(item.price)} · ${count} шт`;
    row.querySelector(".count").textContent = count;
    const thumb = row.querySelector(".cart-page__thumb");
    if (item.image) {
      thumb.src = item.image;
      thumb.alt = item.name;
    }
    row.querySelector(".decrease").addEventListener("click", () => updateCount(id, -1));
    row.querySelector(".increase").addEventListener("click", () => updateCount(id, 1));
    cartPageList.appendChild(row);
  });
  const total = Array.from(cart.entries()).reduce((sum, [id, count]) => {
    const item = getItemById(id);
    return sum + (item ? item.price * count : 0);
  }, 0);
  cartPageTotal.textContent = formatPrice(total);
};

const renderCheckoutPage = () => {
  checkoutPageList.innerHTML = "";
  if (cart.size === 0) {
    const empty = document.createElement("div");
    empty.className = "cart__empty";
    empty.textContent = "Корзина пока пуста.";
    checkoutPageList.appendChild(empty);
    checkoutPageTotal.textContent = formatPrice(0);
    return;
  }
  Array.from(cart.entries()).forEach(([id, count]) => {
    const item = getItemById(id);
    if (!item) return;
    const row = cartPageTemplate.content.cloneNode(true);
    row.querySelector(".name").textContent = item.name;
    row.querySelector(".details").textContent = `${formatPrice(item.price)} · ${count} шт`;
    row.querySelector(".count").textContent = count;
    const thumb = row.querySelector(".cart-page__thumb");
    if (item.image) {
      thumb.src = item.image;
      thumb.alt = item.name;
    }
    row.querySelector(".decrease").addEventListener("click", () => updateCount(id, -1));
    row.querySelector(".increase").addEventListener("click", () => updateCount(id, 1));
    checkoutPageList.appendChild(row);
  });
  const total = Array.from(cart.entries()).reduce((sum, [id, count]) => {
    const item = getItemById(id);
    return sum + (item ? item.price * count : 0);
  }, 0);
  checkoutPageTotal.textContent = formatPrice(total);
};

const renderBadge = () => {
  const totalCount = Array.from(cart.values()).reduce((a, b) => a + b, 0);
  if (totalCount > 0) {
    cartBadge.hidden = false;
    cartBadge.textContent = totalCount;
    cartFab.classList.add("cart-fab--bump");
    cartFab.addEventListener(
      "animationend",
      () => cartFab.classList.remove("cart-fab--bump"),
      { once: true }
    );
  } else {
    cartBadge.hidden = true;
  }
};

const renderCartViews = () => {
  renderCartMain();
  renderCartPage();
  renderCheckoutPage();
  const total = Array.from(cart.entries()).reduce((sum, [id, count]) => {
    const item = getItemById(id);
    return sum + (item ? item.price * count : 0);
  }, 0);
  cartTotalNode.textContent = formatPrice(total);
  renderBadge();
  updateProductModalState();
};

const openCartPage = () => {
  cartPage.classList.add("is-open");
  cartPage.setAttribute("aria-hidden", "false");
};

const closeCartPage = () => {
  cartPage.classList.remove("is-open");
  cartPage.setAttribute("aria-hidden", "true");
};

const openCheckoutPage = () => {
  if (cart.size === 0) {
    alert("Добавьте позиции в корзину перед оформлением.");
    return;
  }
  checkoutPage.classList.add("is-open");
  checkoutPage.setAttribute("aria-hidden", "false");
  closeCartPage();
  closeProductModal();
};

const closeCheckoutPage = () => {
  checkoutPage.classList.remove("is-open");
  checkoutPage.setAttribute("aria-hidden", "true");
};

cartFab.addEventListener("click", openCartPage);
cartPageBackdrop.addEventListener("click", closeCartPage);
cartPageClose.addEventListener("click", closeCartPage);
cartPageCheckout.addEventListener("click", openCheckoutPage);
checkoutButton.addEventListener("click", openCheckoutPage);
checkoutPageBackdrop.addEventListener("click", closeCheckoutPage);
checkoutPageClose.addEventListener("click", closeCheckoutPage);
checkoutPageSubmit.addEventListener("click", () => {
  if (cart.size === 0) {
    alert("Корзина пуста.");
    return;
  }
  alert("Заказ отправлен! Мы свяжемся для подтверждения.");
  closeCheckoutPage();
});

if (productModalBackdrop) {
  productModalBackdrop.addEventListener("click", closeProductModal);
}
if (productModalClose) {
  productModalClose.addEventListener("click", closeProductModal);
}
if (productModalAdd) {
  productModalAdd.addEventListener("click", () => {
    if (!activeProductId) return;
    addToCart(activeProductId);
  });
}
if (productModalDecrease) {
  productModalDecrease.addEventListener("click", () => {
    if (!activeProductId) return;
    updateCount(activeProductId, -1);
  });
}
if (productModalIncrease) {
  productModalIncrease.addEventListener("click", () => {
    if (!activeProductId) return;
    updateCount(activeProductId, 1);
  });
}

document.addEventListener("keydown", (event) => {
  if (event.key === "Escape" && productModal?.classList.contains("is-open")) {
    closeProductModal();
  }
});


searchInput.addEventListener("input", (event) => {
  searchQuery = event.target.value.trim();
  renderMenu();
});

renderCategories();
renderMenu();
renderCartViews();

